[{"page_content": "Graduate Programs Request Info Apply to PSU Postbac Info Our professional graduate programs in Computer Science offer graduate students the structure and push they need to propel their careers forward. Our renowned faculty provide advising and mentorship to graduate students, along with course offerings that specialize in emerging fields of computing such as Machine Learning and Artificial Intelligence, Networks and Security, Data Management and Cloud Computing. The college offers a career director with industry experience to guide our students toward jobs and internship opportunities. Our programs are tightly connected to the many growing and leading tech companies where our graduates earn jobs with competitive starting salaries. For questions regarding our graduate programs, please contact the CS Graduate Advisor ( gccs@pdx.edu ). Graduate Programs Master of Science Doctor of Philosophy Cybersecurity Certificate Grad Prep Master of Science The Master of Science in Computer Science can take about one and a half years of full-time study to complete. The program is intended to provide a strong foundation in the field, along with room for specialization. Doctor of Philosophy The Doctor of Philosophy (Ph.D.) is the highest degree offered in any discipline. It is intended for those who will pursue research in the field of Computer Science. Cybersecurity Certificate The graduate certificate is awarded to students who complete 21 credits in the specialized area of Cybersecurity. Grad Prep A postbac option, the Graduate Preparation Track program can assist high performing, motivated students in mastering the essential computer science core to be successful in the CS Master's program. Previous Next Quick Links Advising Admission Course Schedule Forms & Policies Graduate Courses Track Courses Research Proficiency Exam Recent News April 3rd 2024 Fostering Cybersecurity Literacy in the Native Community: The Pedagogy and Practice of CyberPDX Maseeh College places great value on being an access university, serving... February 6th 2024 The Perils and Possibilities of AI: A Conversation with Ameeta Agrawal Artificial Intelligence is a hot topic these days, inspiring both excitement... January 12th 2024 Sloan grant will help PSU graduate more diverse STEM doctorate students Portland State is home to Oregon’s most diverse undergraduate student population... See all News Upcoming events See full events calendar", "metadata": {"source": "https://pdx.edu/computer-science/graduate", "title": "Graduate Programs | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Admission The Master of Science (M.S.) is the first graduate degree in the field. Students entering the program must have a bachelor's degree and/or adequate background in computer science, such as obtaining an undergraduate computer science program. The Doctor of Philosophy (Ph.D.) is the highest degree offered in any discipline. Students may enter the doctoral program with a bachelor's degree or with a master's degree, and must have adequate background in computer science. Application Deadlines The official deadlines for submission of all materials to the University are as follows: Fall Term 2024 (September start) : March 1st Priority for PhD program: December 15th Winter Term 2025 (January start) : September 15th Spring Term 2025 (April start) : November 1st PSU operates on a quarter system. For future or specific term dates, refer to the PSU Academic Calendar . Please note that these are the dates that the online application closes for the specified term. The application must be submitted by this date. Supporting documents such as test scores and recommendations may arrive after this deadline. Financial support, when offered, typically starts in Fall term. The deadlines for international students are anticipated to account for the time required to obtain visas. Applications should be received by the deadline of the term of admission. Incomplete applications will not be reviewed, so applicants are encouraged to complete all requirements prior to submitting the application. If you are unable to do so, please contact the Graduate Advisor ( gccs@pdx.edu ). Admission Requirements To be considered for admission, all applicants to the CS graduate programs must have: A four-year baccalaureate degree from an accredited institution 1 Minimum undergraduate GPA of 3.0 Proof of English Language Proficiency for International Students The GRE Requirement has been waived through Spring 2025 Graduate Record Examination (GRE) Scores Prospective graduate students are not required to have a Bachelor's degree in Computer Science, but they must make up the background needed for graduate study before applying for admission. See the Grad Prep page for more details. Minimum acceptance: 60th percentile in Quantitative and 25th percentile in Verbal. PhD applicants are expected to be above the minimum. GRE will be waived for an MS applicant if the student completes the Grad Prep program . Admission is selective and meeting minimum requirements does not guarantee admission. All admission decisions are based on the information a prospective student provides. Please contact the Graduate Advisor ( gccs@pdx.edu ) if you would like to discuss your specific situation. Admission Timeline Admission decisions are typically issued about 6-8 weeks after the application deadline (listed above) for complete applications. For applications that are incomplete after the deadline, admission decisions will be issued 6-8 weeks after all required documents have been received. Application Requirements Login or create a new account in the PSU application portal to start a single online application to Portland State University and to a CS graduate program. You will be able to save an incomplete application and return at a later time. Be prepared to submit the requested documents electronically before proceeding to the online application; do not mail any hard copies to the CS department. Please note – do not submit screenshots, photos, or participation certificates for extra-curriculars. For any questions about the online application form, please contact help@applyweb.com . For any questions regarding CS graduate admission, please contact the CS Graduate Advisor ( gccs@pdx.edu ). GRE Score Reports The GRE Requirement has been waived through Spring 2025 Official GRE scores will be required upon admission to a CS graduate program. If you do not have a copy to upload electronically, official copies can be requested from ETS and sent to School code 4610 and Department code 0402. If you have previously taken the GRE as part of another application to a graduate program at a U.S. institution, please contact the CS Graduate Advisor ( gccs@pdx.edu ). The GRE requirement for PhD applicants will only be waived by the admission committee under exceptional circumstances. Transcripts The CS graduate programs require copies of transcripts from each postsecondary institution you have attended (including PSU). Unofficial transcript copies are acceptable for application purposes. Official copies are required upon admission to the program. For more information, see PSU’s transcript requirements . References Contact information for two references are required, preferably those who know your academic performance and potential. Recommendation letters are also acceptable and can be submitted to the CS Graduate Advisor ( gccs@pdx.edu ). Short Personal Statement In 1-2 pages, introduce yourself, your plans, interests, and qualifications. This statement should include your background and interests in computer science, any relevant work experience, why you are seeking a graduate degree, and whether you plan to enroll part-time or full-time. If you plan to enroll part-time, describe your employment or major activities as well. If you are applying for immediate admission to the PhD program, include a description of your potential research area, faculty members you hope to collaborate, and your reasons for not entering the CS master’s program. English Language Proficiency Test Score Reports For international students only, please review the English Language Proficiency requirement webpage for more information about which tests are accepted, and what the minimum score requirements are. If a test score report copy is not available, please list the date the test was taken or will be be taken.", "metadata": {"source": "https://pdx.edu/computer-science/graduate-admission", "title": "Graduate Admission | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Internship Credit The Portland Metro area offers many opportunities for internships to graduate students. Many students complete one or more internships with local companies during their time at PSU. We believe internships provide a valuable training experience which significantly augments the student’s academic program. While some students choose to participate in an internship without receiving college credit, other students find it important that they receive college credit for their internships. NOTE: Internship credits will not be counted towards the CS degree requirements To receive credit for an internship, a student: Must have completed at least 24 credits at PSU towards their PSU CS Degree by the time the internship begins, including at least 2 PSU CS graduate core courses with a grade of B or better; May count undergraduate CS courses taken at PSU that have not been applied to another degree; Must be admitted to the MS or PhD program; Must have filed a CS Masters or PhD Plan of Study; and Must have a PSU CS GPA of at least 3.0 and be in good academic standing as defined by the University and the CS Department. International students will also have to meet the requirements for Curricular Practical Training (CPT) and must consult with the Office of International Students and Scholars Services (intl-services@pdx.edu) to check eligibility. You and your employer should complete and sign the Graduate Internship Approval Form and submit it, along with copies of the internship offer letter, a copy of your current DARS or transcripts, and your approved plan of study to the CS Graduate Advisor no later than the end of the first week of the quarter. We will forward your documents to the appropriate offices on campus and provide you with a copy of all the documents. Once registration opens, we process internship paperwork once a week on Fridays. At the end of each quarter of the internship, make sure you submit a Graduate Internship Status Report form that is signed by both the student and your Supervisor. This will be due to the Computer Science Internship Director no later than 5pm Friday of finals week for the term.Failure to submit the Internship Status Report by the deadline for the term will result in the student receiving a \"No-Pass\" as a grade. In order to get credit for your internship, you’ll need to submit a Special Registration form for CS 504. See the Graduate Advisor to get a copy for the current term.", "metadata": {"source": "https://pdx.edu/computer-science/graduate-internship-credit", "title": "Graduate Internship Credit | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Assistantships Computer Science Graduate Assistants (GAs) are graduate students who are hired to perform instructional, research, or administrative duties for the department. Graduate Assistants at Portland State University are represented by the PSU Graduate Employees Union, AFT/AAUP. Teaching Assistantships A limited number of teaching assistantships are available to our best-qualified graduate students. These assistantships are granted for one term at a time, and are renewable based on the student's performance in coursework and TA responsibilities. A teaching assistantship pays a monthly stipend and a tuition remission. The student might teach a course under the supervision of a faculty member or grade papers for approximately 15-20 hours per week. Our selection process for teaching assistants are similar to those used for graduate admission : grades, references, plus evidence of teaching experience or ability. Please note that a PSU Odin account is required to access the application. Apply for TA-ship about this content Research Assistantships Faculty in the department have research grants that support research assistants (RAs). Faculty members choose RAs on an individual basis, but the most important criterion is the student's ability to contribute to the professor's research program. Ordinarily, students are given a research assistantship only after they have been in the graduate program for at least one term and have taken at least one class from the professor. After advancing to candidacy (see doctoral program), doctoral students are normally supported by a research assistantship with their dissertation adviser and may be able to use the work supported by the assistantship as a part of their own research.", "metadata": {"source": "https://pdx.edu/computer-science/graduate-assistantships", "title": "Graduate Assistantships | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Courses The following list contains all graduate courses that can appear on the Computer Science schedule, including selected courses offered by other departments. (The schedules for the 2023-2024 academic year are available, together with schedules for previous years .)  Please note that some courses are experimental and may not be offered on a regular basis. These may be subject to change each academic year. Regular Courses: CS 515 Parallel Programming CS 518 Cultural Competence in Computing CS 530 Internet, Web, & Cloud Systems CS 531 Introduction to Performance Measurement, Modeling and Analysis CS 532 Operating System Foundations CS 533 Concepts of Operating Systems CS 535 Accelerated Computing with GPU's and Xeon Phi CS 538 Computer Architecture CS 540 Deep Learning: Computational Structures and Programming CS 541 Artificial Intelligence CS 545 Machine Learning CS 547 Computer Graphics CS 551 Numerical Computation CS 554 Software Engineering CS 557 Functional Programming CS 558 Programming Languages CS 563 Intro to Web Development CS 564 Front End Web Development CS 565 Full Stack Web Development CS 566 Voice Assistants CS 569 Scholarship Skills for Computer Science & Engineering CS 576 Computer Security Research Seminar CS 577 Modern Language Processors CS 578 Programming Language Semantics CS 580 Randomized Algorithms and Probabilistic Analysis CS 581 Theory of Computation CS 584 Algorithm Design & Analysis CS 585 Cryptography CS 586 Introduction to Database Management Systems CS 587 Database Management Systems Implementation CS 588 Cloud & Cluster Data Management CS 589 Blockchain Development & Security CS 590 Introduction to Multimedia Computing and Networking CS 591 Introduction to Computer Security CS 592 Malware Reverse Engineering CS 593 Digital Forensics CS 594 Internetworking Protocols CS 595 Web and Cloud Security CS 596 Network Security CS 658 Programming Languages CS 669 Scholarship Skills for Computer Science & Engineering CS 676 Computer Security Research Seminar CS 677 Modern Language Processors CS 678 Programming Language Semantics CS 684 Algorithm Design & Analysis Special Topic Courses (Active): CS 510 Top: Advanced Topics in C++ Programming CS 510 Top: Advanced Topics in Concurrency CS 510 Top: Advanced Topics in Program Verification CS 510 Top: Adventures in Natural Language Processing CS 510 Top: Code Large Language Models CS 510 Top: Code Reading & Review CS 510 Top: Programming Language Compilation CS 510 Top: Computational Photography CS 510 Top: Computer Game Design CS 510 Top: Computer Vision and Deep Learning CS 510 Top: Computers, Sound and Music CS 510 Top: Contemporary Software Development with Java and Android CS 510 Top: Data Clustering CS 510 Top: Data Engineering CS 510 Top: Ethics in Artificial Intelligence CS 510 Top: Exploring Fractals CS 510 Top: Formal Proof Foundations CS 510 Top: Foundations of Computer Vision CS 510 Top: Foundations of Emerging Technologies CS 510 Top: Generative Security Applications CS 510 Top: Graphical Models for Optimization and Learning CS 510 Top: Introduction to Computational Imaging CS 510 Top: Introduction to Computational Photography CS 510 Top: Introduction to Data Mining CS 510 Top: Introduction to Healthcare Data Analytics CS 510 Top: Introduction to Privacy-aware Computing CS 510 Top: Introduction to Quantum Computing CS 510 Top: Large Language Models CS 510 Top: Mobile and Wireless Networks CS 510 Top: Mobile Health CS 510 Top: Mobile Health in the COVID Era CS 510 Top: Natural Language Processing CS 510 Top: Networked Markets CS 510 Top: Operating System Internals CS 510 Top: Programming Language Compilation CS 510 Top: Proof Assistants and Program Verification CS 510 Top: Reinforcement Learning CS 510 Top: Rust for Small Systems Programming CS 510 Top: Rust Programming CS 510 Top: Rust Web Development CS 510 Top: Secure System Administration and DevOps CS 510 Top: Unconventional Cameras CS 510 Top: Usability Engineering CS 510 Top: Wireless Networks and Applications CS 610 Top: Computational Photography CS 610 Top: Graphical Models for Optimization and Learning CS 510 Top: Virtual Reality Other Courses: CS 520 Object-Oriented Programming and Design CS 542 Advanced Artificial Intelligence: Combinatorial Games CS 543 Advanced Artificial Intelligence: Combinatorial Search CS 546 Advanced Topics in Machine Learning CS 549 Computational Geometry CS 550 Parallel Algorithms CS 552 Building Software Systems with Components CS 553 Design Patterns CS 555 Software Specification and Verification CS 556 Software Implementation and Testing CS 559 Software Measurement & Models CS 560 Human-Computer Interaction CS 561 Open Source Software Development Laboratory CS 562 Advanced Open Source Software Engineering CS 567 The Wireless Web CS 568 Functional Logic Programming CS 570 Machine Learning Seminar CS 572 Operating System Internals CS 575 Computer Systems Analysis CS 579 Formal Verification of Hardware/Software Systems CS 582 Theory of Computation: Advanced Topics CS 583 Automata and Formal Languages CS 597 Sensor Networks CS 598 Introduction to Wireless Network Protocols CS 653 Design Patterns CS 655 Software Specification and Verification CS 656 Software Implementation and Testing CS 659 Software Measurement & Models CS 668 Functional Logic Programming CS 672 Operating System Internals Other Special Topic Courses: CS 510 Top: Advanced Functional Programming CS 510 Top: Advanced Java Programming CS 510 Top: Algorithms Coding CS 510 Top: Generative AI CS 510 Top: Introduction to HCI CS 510 Top: Introduction to Visual Computing CS 510 Top: Languages and Low-Level Programming CS 510 Top: Markets and the Internet CS 510 Top: Modern Agile and Other XP Software Engineering CS 510 Top: Modern Embedded Computing CS 510 Top: Network Security CS 510 Top: Practicum in Asynchronous Systems and Algorithms CS 510 Top: Software Design Patterns CS 510 Top: Spoken Language Interfaces CS 510 Top: Theorem Proving and Program Verification CS 510 Top: Topics in Software Validation CS 510 Top: Unit Test Branching Strategy CS 510 Top: User Interfaces CS 510 Top: Compilers and Interpreters To review course descriptions of previously offered courses, please contact the instructor or review the PSU Bulletin . CS Catalogs 2021-22 2020-21 2019-20 2018-19 2017-18 2016-17 2022-23", "metadata": {"source": "https://pdx.edu/computer-science/graduate-courses", "title": "Graduate Courses | Portland State University", "language": "en"}, "type": "Document"}]