[{"page_content": "Computer Science The Department of Computer Science offers a full range of courses and degree programs. Our programs, in addition to the opportunities to develop professional skills through MECOP and PCEP, are designed to provide students with the educational background to achieve a career in the computing industry. With over 800 undergraduate CS majors and almost 200 graduate students, we offer a community to learn, discover, innovate, and share a curriculum based on the application and theoretical foundations of Computer Science. The department is home to 31 regular faculty members who specialize in a variety of research areas such as computer graphics and vision, computer security, databases, intelligent systems, programming languages, software engineering, open source software, sensor networks, and high performance computing. We invite you to join our Computer Science community and to explore our programs! Department Office Hours: The department is operating during regular hours but, due to the pandemic, we are relying on virtual meetings, except for absolutely critical activities. Please contact an appropriate person on the list below if you need help via email or if you would like to arrange a time for a phone call or an in-person or online meeting: Undergraduate Advising: uccs@pdx.edu Graduate Admissions & Advising: gccs@pdx.edu Department Manager: sarreal@pdx.edu Department Chair: mpj@pdx.edu Department Services Coordinator: elisa.salgado@pdx.edu CS Office: csoffice@pdx.edu We look forward to hearing from you and will do our best to respond as soon as we can. ABOUT THE MASEEH COLLEGE OF ENGINEERING AND COMPUTER SCIENCE Computer Science is one of five departments within the Maseeh College of Engineering and Computer Science . At the Maseeh College, we offer academic programs that provide transformative opportunities within the classroom and beyond. If you join our college, you'll be connected to Portland’s growing, innovative industries and prepared to gain competitive jobs in engineering and computer science. Our close ties to leading tech companies give you the opportunity to build your professional skills through internship programs while you complete your degree. You can participate in research, community-based learning projects and opportunities to develop your own ideas from proposal to prototype through our innovation programs. Our students are in demand in the Portland job market and beyond, and they report the highest annual earnings of all PSU graduates one year after graduation. 8.3.0 Apply to PSU Explore Maseeh Visit Campus Undergraduate Programs Graduate Programs CS Student Resources Research The Computer Science Department's Coronavirus Response The Portland State University community stands together against the global COVID-19 pandemic. Find out more with the latest updates about how the Computer Science department is responding. Coronavirus Response Statement from the Department Chair A statement from Dr. Mark Jones, Computer Science Department Chair. Read Statement Quick Links CS Advising Course Schedule Forms & Policies Postbac Options", "metadata": {"source": "https://pdx.edu/computer-science/", "title": "Computer Science | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Preparation Apply to PSU Apply to CS Postbac Info Many graduates with degrees in fields other than Computer Science are interested in pursuing a M.S. in Computer Science. The Graduate Preparation (or \"Grad Prep\") Track can assist a high performing, motivated student in mastering the essential computer science core necessary to be successful in the Master's program. The Grad Prep Track consists of a Programming & Languages Core and a Theory Core, comprised of many of the same classes taken by undergraduate Computer Science majors. Some of these courses have the option to test out of by demonstrating mastery based on either prior academic preparation or professional/personal programming experience through a credit by exam process. We encourage all prospective students to attend one of our monthly CS Postbac Info sessions first to learn more about our postbaccalaureate options . Contact the CS Graduate Advisor ( gccs@pdx.edu ) for any questions. Grad Prep Requirements To be eligible for admission to the CS Master's program, Grad Prep students must complete the following courses with a B or better. For Grad Prep students, the GRE is waived for the M.S. application . CS 199 Prog & Problem-solving: First Exploration (4 credits)* CS 161 Intro to Programming & Problem-solving (4 credits)* CS 162 Intro to Computer Science (4 credits)* CS 163 Data Structures (4 credits) CS 205 System Programming & Architecture (4 credits) CS 250 Discrete Structures I (4 credits) CS 251 Discrete Structures II (4 credits) CS 302 Programming Methodologies and Software Implementation (4 credits) CS 333 Intro to Operating Systems (4 credits) OR CS 532 Operating Systems Foundations (3 credits) CS 350 Algorithms and Complexity (4 credits) *Based on prior experience, a student may begin with any of these courses. See Introductory Course Guide for details. Admission to PSU To begin Grad Prep at PSU, prospective students must first apply for postbaccalaureate admission . Postbaccalaureate applications are processed as they are received, generally within 4-6 weeks. Sample Schedules Students who did not take math beyond pre-calculus in their prior coursework are strongly advised to take at least one such course (e.g. calculus, linear algebra, discrete math, etc.) prior to taking CS 250. This sample program assumes the student has modest programming experience and an adequate mathematical background. This sample program assumes the student has no prior programming experience and a limited mathematical background. Frequently Asked Questions Is the admission process to the CS program selective? No. At this time, all students that meet the admission requirements are admitted to the CS program. Can I have courses in progress while I submit my application? Yes, courses required for admission may be in progress at the time of application. If the in-progress coursework is not completed with the appropriate grade by the end of the term, CS admission may be revoked and the student may be dropped from all upper division CS courses (see number 4 below). What if I am in my last course at a community college and the course is not on my PSU DARS? Submit a current unofficial transcript from the college that shows the course in progress and your name and attach it to your application. Once your grade is recorded for this class, send an official transcript to PSU Admissions. What does conditional admittance mean? Students that apply to the program with courses in progress and have met all the other requirements will be admitted to the CS program on the condition that they receive a passing grade for the required classes in progress. Students will be allowed to register for upper division CS courses. At the end of the admission term, grades for classes which were in progress will be checked and students that have not passed will have their admission revoked and administratively dropped from their upper division CS courses. Once I'm admitted to the CS program, will my tuition increase? Yes, the Maseeh College of Engineering and Computer Science charges a differential tuition for admitted students to pay for use of College resources. Details of tuition and fees are located on Student Finance page . What if I am denied admission? Consult the CS Graduate Advisor ( gccs@pdx.edu ). Depending on the reason for the denial, you may request a review by the CS Appeals Committee.", "metadata": {"source": "https://pdx.edu/computer-science/grad-prep", "title": "Graduate Preparation | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Master of Science The Master of Science (M.S.) in Computer Science is the first graduate degree in the field, and can take one and a half years of full-time study to complete. The master's program is designed to prepare students for advanced careers in the computing industry, to create a research environment in computer science, and to prepare students for graduate work at the Ph.D. level. Students entering the program must have a bachelor's degree and/or adequate background in computer science. The master's program requires the completion of an approved program of 45 credits, with a thesis option. Coursework includes core courses in theory and programming practice, plus a 9-credit concentration in one specialization area. Core Requirements (6) Students are encouraged to take these courses as early as possible in your graduate program. One Theory course from: CS 581 Theory of Computation (3) CS 584 Algorithm Design & Analysis (3) CS 578 Programming Language Semantics (3) One Programming Practice course from: CS 558 Programming Languages (3) Any 500-level course designated by the department as programming-intensive (noted by a P in the undergraduate course section) (3) Track Requirements (9) All students in the CS Master's program must take three courses from a single track of the following: Databases Artificial Intelligence & Machine Learning Languages & Programming Security Software Engineering Systems & Networking The list of required courses and approved electives for each track are listed in the Track Courses page . Elective Requirements (30) Students must take enough electives to complete 45 total credits for the MS degree. Electives can be any 500-level CS course (see specific notes regarding CS 501-509 coursework below). A limited number of credits taken outside Computer Science can count towards the elective requirements, with advisor approval.  Read more about Non-CS credits below. CS 505 (READING & CONFERENCE) AND CS 506 (SPECIAL PROJECT) CREDITS Students who are interested in exploring a specific topic or conducting a special research or other project for credit have the option to register in CS 505 (Reading & Conference) and/or CS 506 (Special Project) credits. A maximum of 6 credits of CS 505 and CS 506 can be counted towards the CS Master’s degree elective requirements. Examples: CS 505 Reading & Conference: the student will study a textbook on a particular topic; complete the end of chapter problems; and discuss/present their chapter summaries, exercise solutions, and other content with the supervising faculty member. CS 506 Special Project: the student will gather and analyze data or research an agreed topic and write up their results in a presentable format under the guidance of the supervising faculty member. Students first need to find a faculty member to supervise these credits. The faculty member can help students to develop their idea, to ensure that it is consistent with the academic goals of the program, and to determine the appropriate course number, credit number, and project scope. They will assign the final grade at the end of the term. The By Arrangement Approval Dashboard can be used to register for CS 505/506 credits. Either the student or the faculty member can initiate a request, and once both have approved it, the request is automatically forwarded to the Department for approval and then to the Registrar’s Office for processing. Thesis Option The thesis option requires the completion of 45 credits including 6-9 credits of CS 503 (Thesis) and an oral thesis defense. Students must follow PSU policies regarding committee appointments, defense procedures, formatting requirements, and submission procedures. University requirements and additional information for a master’s thesis are outlined by the PSU Graduate School. A thesis defense must take place in a meeting with the student and the appointed committee. It should be scheduled on a date that meets the GS deadline for the desired graduation term. A room for the thesis defense may be scheduled through the CS department ( csoffice@pdx.edu ). Thesis students will need to send their abstract/bio information and any requested equipment (projector) at least two weeks in advance of the defense to the CS Graduate Advisor ( gccs@pdx.edu ). Advising All newly admitted MS students will be advised by the CS Graduate Advisor. Every MS student is required to maintain a plan of study form , which outlines both courses taken so far towards the degree and courses planned for the remainder of the program. This will also note any transfer and pre-admission courses, non-CS courses, and a student’s intended track. An initial plan must be submitted to the CS Graduate Advisor by the end of the second term after the student’s formal admission to the program. Approval from the CS Graduate Advisor will indicate an acceptable outline of the student’s coursework. However, the plan can be revised at any time by mutual agreement of the student and the CS Graduate Advisor. A final version of a student’s plan of study should be submitted by the student’s last term of the program. Students completing a thesis are required to have a faculty adviser. Pre-admission, Transfer, and Non-CS Credits A minimum of 30 credits must be taken in Computer Science at Portland State University. Given this, students may use a combined total of 15 pre-admission, transfer, and non-CS credits toward their Master’s degree with CS Graduate Advisor approval ( gccs@pdx.edu ). One additional credit beyond the 15 credit limit can be used provided none of the courses are a 1-credit course. Pre-admission credits (taken before the term of formal admission) can include both transfer and PSU credits. Pre-admission credits taken at PSU are requested via a DARS exception submitted to the Graduate School. This request should be made soon after admission to the graduate program. Transfer credits refer to credits taken from another institution other than PSU. To request approval of transfer credits, complete and submit the GO-21M form (Proposed Transfer Credit) to the CS Graduate Advisor. Students should submit the GO-21 form during the first term of enrollment in the program, so there is sufficient time to complete any additional coursework that may be necessary. Any transfer credits must be approved before graduation paperwork can be processed. OHSU joint campus credits are considered transfer credits and are transferred via a different process. Read below for more information. Non-CS credits taken outside of Computer Science, such as ECE or Math*, can count towards elective requirements once approved. Non-CS courses must be graduate level. *Exception: only one ETM course will count towards the elective requirements. All ETM courses are eligible to transfer but students are limited to using only one for the CS degree requirements. Departmental Requirements In addition to the departmental requirements, students should review the university master's degree requirements . A minimum of 30 credits must be taken at Portland State University. Maintain good academic standing with a cumulative graduate GPA of 3.00 or higher in all graduate credits earned at PSU. All graded courses must be passed with a grade of B- or better. Core requirements must be passed with a grade of B or better. All courses taken Pass/No Pass must be passed. Coursework may include up to 6 credits of CS 505 (Reading and Conference) and CS 506 (Special Projects). CS 501 (Research), CS 502 (Independent Study), CS 504 (Internship), and CS 509 (Graduate Assistant Practicum) credits cannot be applied. Review the rules regarding CS 504 (Internship) . All coursework applied to the master’s program must be completed within seven years prior to the awarding of the degree. If any credits are more than 7 years old at the time you apply for graduation, they may need to be re-validated . Joint Campus Registration with OHSU Admitted graduate students at Portland State may take graduate courses offered by Oregon Health and Science University and have the credits included in their current term enrollment and tuition assessment at PSU. Only specific courses are approved for this joint campus arrangement . Students must have permission from the instructor of the OHSU course as well as their home department to use the joint campus registration process and apply the OHSU courses to their PSU degree. Contact the CS Graduate Advisor ( gccs@pdx.edu ) for details. Graduation Procedure Follow the university’s outline for Master’s degrees . Apply for graduation by the first Friday of the first week of the anticipated term of graduation. See the Graduate Candidate Deadlines for specific dates. Submit a revised Plan of Study (if your coursework has changed since the initial filing) to the CS Graduate Advisor. For Thesis students, submit the GO-16M form to the Graduate School. See the Graduate Candidate Deadlines for specific dates.", "metadata": {"source": "https://pdx.edu/computer-science/master", "title": "Master of Science | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "PCEP Internship What is the PSU/PDX Cooperative Education Program? The PSU/PDX Cooperative Education Program (PCEP) is a two-year cooperative educational program in which Computer Science students work 20 hours per week at one of our local PCEP Partner companies in a series of defined internship roles, while concurrently taking between eight and twelve credits each term on-campus at PSU. Pay begins at $27 an hour with semi-annual raises. New internship cycles start approximately every six months (January and July), and interns must work at two or more PCEP companies in at least two different roles during the program. Why Should I Care? The PCEP co-op will give you real-life experience in two different roles (software development and software automation) at two or more different local software companies while allowing you to take eight to twelve credits of coursework each term on campus. Not only will you gain technical experience, you'll also learn how to work in a professional environment as part of a team developing commercial software for a global customer base, while simultaneously building your professional network. A PCEP co-op will jumpstart your career as a software professional. Who Qualifies? Any student admitted to the B.S. Computer Science degree program at Portland State University, who will have completed CS163, CS205, CS302, and CS314, with grades of B or better, by the time their co-op begins may apply. In addition, applicants must have a 3.0 GPA overall required Computer Science coursework, be over 18, and have the permanent right to work in the United States (some positions require U.S. citizenship). See the Student Expectations for more information. What are the Important Dates I should know about? *All dates are subject to change April 11, 2024 (Thursday): Mandatory Orientation Session via Zoom. One session will be held at noon, and one will be held at 6:30 PM. Preregister for one of these by selecting a time using this registration link . You must attend this session in order to apply to the PCEP program. The registration cut-off is Tuesday, April 9. A Zoom link will be sent to those that register using their @pdx.edu e-mail address by Wednesday, April 10. April 22, 2024 (Monday): Applications are due by noon (an application link will be emailed to those that register and attend Orientation). April 30, 2024 (Tuesday): PCEP Finalists invited to the RUSH. May 10, 2024 (Friday): PCEP RUSH. May 20, 2024 (Monday): Placements Announced. July 1, 2024 (Monday): New interns begin work. Register Who are the PCEP Companies? The PCEP companies are among some of the most exciting software companies in the Portland Metro area. Their markets range from computer security and web analytics to healthcare, social media solutions and county government, as well as everything in between. The PCEP companies are located in downtown Portland, so students have easy walking and public transportation options for getting back and forth between work and school. Many of the PCEP companies support hybrid or completely remote internships. In becoming a PCEP Partner, each company has acknowledged the student's educational goals are primary - they have agreed the internship program must augment, not conflict, with the educational goals of the student. This results in internships that are not only valuable to the company, but are also genuine educational experiences for the student.", "metadata": {"source": "https://pdx.edu/computer-science/pcep-internship", "title": "PCEP Internship | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Doctor of Philosophy (Ph.D.) The Doctor of Philosophy (Ph.D.) is the highest degree offered in any discipline. It is intended for those who will pursue research in the field. The degree is usually required to teach computer science at the university level, and for employment in prestigious industrial research laboratories. Students may enter the doctoral program with a bachelor's degree or with a master's degree, and must have adequate background in computer science. Since completion of the degree requires presentation of a dissertation comprising of original research, the time required is pre-determined. Four to six years of full-time work are typical, less if the student enters with a Master's degree in computer science. Advising Upon admission to the doctoral program, a faculty adviser will be designated by the CS Director of graduate studies to advise and meet the student in regular consultation concerning the program of study and research. Your CS faculty adviser approves the courses in your program, including non-CS courses and courses taken outside of PSU. Students and their advisers will fill out a Ph.D. Plan of Study form after the student successfully completes 9 graduate level credits, no later than 6 months before their Research Proficiency Exam (RPE) . Doctoral students are also assigned to additional faculty members that make up an advisory committee during their first term. The role of the committee is to monitor the student’s progress, to offer academic guidance, and to provide a resource in resolving academic or advising issues. The advisory committee consists of three faculty members, but they may come from different research areas of the faculty adviser. The committee will meet with the student in the Fall and Spring terms to generate a written assessment of progress and to set goals in writing for the next term. The committee, in consultation with the CS director of graduate studies, has the authority to delay a student’s RPE date. The committee's opinion shall have strong weight in determining whether the student should continue to receive departmental support in the form of a teaching assistantship. The advisory committee's role is taken over by the dissertation committee when the student advances to candidacy. When a doctoral student begins research work on a PhD dissertation, the faculty adviser should be the person that will supervise the dissertation. If a new faculty adviser has been identified, submit a ‘ Change of Advisor form ’ to the CS Graduate Advisor ( gccs@pdx.edu ). The faculty adviser must be a full-time faculty member and must agree to the change. Any changes should be properly recorded and processed by the CS department. Graduate Assistantships First-year Ph.D. students who are admitted with financial support are typically supported as a Teaching Assistant for up to three quarters, which typically pays a monthly stipend and a tuition remission. The student might teach a course under the supervision of a faculty member or grade papers for approximately 15-20 hours per week. Ph.D. students may apply to serve as a TA for an additional three quarters, but are highly encouraged to connect with a potential faculty adviser for a research assistantship. Apply for TA-ship Curriculum Core Courses (18 credits) - Generally expected to be completed by the end of the second year. CS 581 Theory of Computation (3) CS 684 Algorithm Design & Analysis (3) CS 558 Programming Languages (3) CS 533 Concepts of Operating Systems (3) CS 538 Computer Architecture or ECE 585 & ECE 586 (3) CS 669 Scholarship Skills for Computer Science & Engineering (3) Other Elective Courses (27 credits) Any graduate level courses in Computer Science, subject to guidance listed under Departmental Requirements CS 601 Research or Other Elective Credits (18 credits) CS 603 Dissertation Research Credits (27 credits) Departmental Requirements In addition to the departmental requirements, students should review the university's doctoral degree requirements . Maintain good academic standing with a cumulative graduate GPA of 3.00 or higher in all graduate credits earned at PSU. All regular courses must be graded (not P/NP) and passed with a grade of B or better. Maintain a 3.5 GPA in core course work, with a minimum grade of B. Research, projects, internships, independent study and reading & conference credits may be graded P/NP or with a letter grade. These credits are set up independently by the student and a faculty member. These credits must be passed with a P or a grade of B or better. Students must be registered for a minimum of 1 graduate credit during the term the comprehensive exam is taken. For elective courses: These courses should be used to strengthen the program in the student's research area. CS 501/601 (Research) and CS 509/609 (Graduate Assistant Practicum) may not be counted. A maximum of 6 credits of CS 502/602 (Independent Study), CS 505/605 (Reading and Conference), and CS 506/606 (Special Projects) may be counted. Advancement to Candidacy A student is advanced to candidacy after passing the comprehensive exam and successful defense of the dissertation proposal. Comprehensive Examination The comprehensive exam is a university requirement for the doctoral degree. In the CS Department, it takes the form of the Research Proficiency Examination (RPE), covering original research performed by the student. The exam consists of a written paper, public oral presentation, and a public question and answer session. Passing the exam is required before a PhD student can prepare and defend a dissertation. Review more about the comprehensive exam on our Research Proficiency Exam page. Dissertation Proposal After passing the comprehensive exam and identifying a dissertation research topic, a dissertation committee will be appointed to the student and will take over the role of the advisory committee (see Advising section above). If the research topic has changed since admission, students should change their faculty adviser to the person that will supervise the dissertation. If a new faculty adviser has been identified, submit a ‘change of advisor form’ to the Graduate Advisor ( gccs@pdx.edu ). Any changes should be properly recorded and processed by the Computer Science office. The proposal: Identifies the general research field (e.g. networks) and presents an annotated bibliography of literature relevant to the particular dissertation topic (e.g. verification of network routing protocols). Describes the research problem. Describes the proposed approach to solving the problem, including specific methods to be tried. Gives a timeline for completing the work. The written proposal will be circulated among the dissertation committee, and upon satisfactory agreement, the student will publicly present the proposal. The presentation begins with an oral talk, then the dissertation committee will question the student privately. Students satisfactorily progressing are expected to have a dissertation proposal approved by the end of the third year. The abstract and date for the defense must be submitted to the CS Graduate Advisor at least two weeks in advance of the date of the defense. Dissertation Defense Under the direction and consultation of the dissertation committee, Ph.D. candidates must complete a dissertation consisting of original research. The student will prepare, revise, and correct a draft of the dissertation as directed by the dissertation committee until it meets the approval. The work is expected to be a quality of merit publication in refereed journals or conferences. After preparation of the written dissertation, a candidate’s dissertation committee will conduct a dissertation defense. The candidate is expected to prepare an oral presentation on the research methodology and results. The abstract and date for the defense must be submitted to the CS Graduate Advisor at least two weeks in advance of the date of the defense. The final, approved dissertation should be submitted to csoffice@pdx.edu for posting. PSU has a set of Dissertation Guidelines that describe the format and content requirements for the dissertation. Graduation Procedures Follow the university's outline for Doctoral degrees . Apply for graduation by the first Friday of the first week of the anticipated term of graduation. Submit a revised Plan of Study to the CS Graduate Advisor ( gccs@pdx.edu ). Submit the GO-17D form to the CS Graduate Advisor. Graduate Candidate Deadlines", "metadata": {"source": "https://pdx.edu/computer-science/doctor-philosophy-phd", "title": "Doctor of Philosophy (Ph.D.) | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "BACHELOR'S PROGRAM IN COMPUTER SCIENCE  CAPSTONE Capstone is taken by undergraduate students in the final year of their program. They will work in teams of 6-8 students on a six-month software development project to benefit a company, individual or organization in the community. Sponsoring organizations will be available to students on a regular basis to provide input and feedback as the project develops. New projects begin every quarter (Fall, Winter, Spring and Summer) and last for two quarters. Potential sponsors should consult the Guidelines for Sponsors . The Capstone home page provides additional information about the program, including Capstone presentation videos. IMPORTANT : Students who planned to begin the CS Capstone sequence in Winter 2024 (CS 469 in Winter and CS 470 in Spring) are required to attend one of the two mandatory orientation meetings that take place on: Friday, Nov 3 from 4-5pm (Remote only: this meeting is on Zoom) Additional Meeting details will be announced soon. Students who will be starting Capstone after Winter 2024 can check back later for further updates .", "metadata": {"source": "https://pdx.edu/computer-science/bachelors-program-computer-science-capstone", "title": "BACHELOR'S PROGRAM IN COMPUTER SCIENCE CAPSTONE | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Cybersecurity Graduate Certificate The Cybersecurity Graduate Certificate program requires admission as a graduate student. The program requires 21 hours total of graduate classes. There are two core classes for a total of 6 hours. In addition, five elective classes must be taken for the needed additional 15 credit hours. Certificate Requirements Gain Admission to our Graduate CS Program as either an M.S. or Ph.D. candidate. Note that an M.S. candidate may choose to either get both an M.S. and the Cybersecurity Graduate Certificate, or just complete the Cybersecurity Graduate Certificate. Fill out the GO-19 form needed for admission to the certificate program. Make sure you ADD a certificate to your program. You also need your advisor's signature on the form. Your advisor must approve your plan to get the Security Certificate. Please return the completed form to the Graduate Advisor. Once you have submitted your GO-19 form, the Security Admission Committee will meet and approve or deny your application. Applicants will be notified of the committee's decision via email. Course Requirements Required Core Courses (6) CS 591 Introduction to Computer Security (3) CS 595 Web and Cloud Security (3) Five of the following courses or approved substitute courses (15) CS 554 Principles of Software Engineering (3) CS 555 Software Specification and Verification (3) CS 556 Software Implementation and Testing (3) CS 576 Computer Security Seminar (3) CS 585 Cryptography (3) CS 592 Malware Reverse Engineering (3) CS 593 Digital Forensics (3) CS 594 Internetworking Protocols (3) CS 596 Network Security (3) Any CS 510 course in Security (3)", "metadata": {"source": "https://pdx.edu/computer-science/cybersecurity", "title": "Cybersecurity Graduate Certificate | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Biomedical Informatics Portland State University and Oregon Health & Science University offer an accelerated, collaborative degree program in Biomedical Informatics . Designed for high achieving freshmen, students in this program combine PSU and OHSU courses to receive both a B.S. Computer Science degree and a Master of Science in Biomedical Informatics degree at the end of five years. What is Biomedical Informatics? Biomedical Informatics is an interdisciplinary field which combines knowledge of biology, computer science, informatics and information engineering to assist in the management of health and biomedical information. Modern medicine has spawned this new spectrum of interdisciplinary scientists who have a combined understanding of computer and biological sciences in order to advance research and medical discovery at unprecedented rates and levels. Biomedical Informatics played a leading role in research successes such as the mapping of human genes, also known as the human genome project. Projects of this type require data analysis and computing expertise as well as medical research talent to analyze and manage billions of data elements. Scientists and scientific institutes around the globe now include these technology experts as leading contributors to advanced research teams. The field of biomedical informatics is a fast growing and highly sought area in medical science. According to Merriam Webster, informatics is \"the collection, classification, storage, retrieval, and dissemination of recorded knowledge treated both as a pure and as an applied science.\" Click here for more information. Program Overview Biomedical Informatics graduates are in high demand. Alumni of the program enter a broad range of career fields including: research, teaching, health care information technology, biomedical information applications programming, and health care computing industry. The Biomedical Informatics program is designed for high-achieving high school applicants with an interest in Biology and Computer Science. They must meet the following requirements: Minimum 3.5 cumulative GPA 1200 combined SAT / 26 composite ACT Minimum 3.0 GPA in all high school mathematics courses Successful completion of pre-calculus and physics Students begin taking courses from OHSU during their fourth year, and by their fifth year, they are taking courses exclusively from the OHSU Biomedical Informatics program. Successful students in the Biomedical Informatics program maintain a minimum PSU cumulative 3.0 GPA. In addition, they will have received a verbal score of 500 or above, quantitative score of 600 or above and an analytical score of 4.0/600 or above on the GRE (Graduate Record Examination) by the beginning of their fourth year. Upon successful completion of the GRE and required Portland State coursework, students begin taking courses at Oregon Health & Science University in their third or fourth year. By the end of the fourth year, all courses will be taken at OHSU. Successful students will receive both a B.S. Computer Science and an M.S. Biomedical Informatics degree at the end of five years. See a sample 5-year program schedule . For more information, contact the CS Undergraduate Advisor ( uccs@pdx.edu ).", "metadata": {"source": "https://pdx.edu/computer-science/biomedical-informatics", "title": "Biomedical Informatics | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Accreditation The Portland State undergraduate Bachelor of Science Computer Science degree program is accredited by the Computing Accreditation Commission of ABET, https://www.abet.org , under the General Criteria and the Computer Science and Similarly Named Computing Program Criteria. Accreditation certifies that a program meets or exceeds the minimum criteria for quality education, ensuring a quality educational experience for students. Accreditation has two advantages for students: Accreditation is a form of quality control. The CAC sets minimum standards for every aspect of a degree program, and, periodically, they send an evaluation team to examine everything from the degree requirements (which are stiffer than average, at their insistence) to the way classes are conducted and graded. The evaluation team will also interview students, staff, and faculty, and examine our facilities, and curriculum materials.  A program is accredited only if everything is up to par. Accreditation adds real market value to the degree.  For example, some companies (particularly those accustomed to hiring engineers) pay better starting salaries, and sometimes job titles, if the employee comes from an accredited degree program. Program Educational Objectives and Student Outcomes The design and delivery of our Bachelor's program is guided and informed by a set of program educational objectives and associated student outcomes that are posted on the department's website. Annual Student Enrollment and Graduation Data Bachelor's degrees awarded in Computer Science and undergraduate enrollment by academic year are available on the degree and enrollment data website .", "metadata": {"source": "https://pdx.edu/computer-science/accreditation", "title": "Accreditation | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Discover CS Cohort Request Info about Discover CS Cohort Technology influences nearly every field of study and impacts almost every aspect of our lives. Do you wonder how your favorite apps are created, how music and movies are streamed, or how a self-driving car works? Are you creative and enjoy solving problems and working together as a team? These are a few of the traits of a computer scientist. Learning to think like a computer scientist gives you the knowledge, skills, and power to solve important problems that can help your community ! No coding experience? No problem! Do you want to explore a major in computer science, or develop skills that complement your current career goals? Look no further! The Department of Computer Science at Portland State University is excited to announce our new Discover CS Cohort program for our introductory course sequence: CS 161 Introduction to Programming and Problem-Solving CS 162 Introduction to Computer Science CS 163 Data Structures Benefits of joining a cohort include: Learning alongside a small group of peers with similar goals and interests Collaborative problem-solving and group discussions A supportive and inclusive learning environment Opportunities to network and build connections in the tech industry Consistent in-person teaching style and approach Increased opportunities for personalized feedback and support Building a relationship with the instructor as a mentor and future resource The next cohort will start in Fall 2024 and we are looking for students who can make a commitment to continue with the three-course cohort: CS 161 in the Fall, and then CS 162 and CS 162 in the following Winter and Spring terms. Don't miss out on this unique opportunity to explore the exciting field of computer science! How do I enroll in this cohort? Reach out to the department by completing the Request Information form or emailing Stephanie Allen at steallen@pdx.edu and we will be in touch! You will be given a special code to use when registering for courses. Frequently asked questions: When does the cohort start? The next cohort will start in Fall 2024. Classes will be in person on Monday and Wednesday from 11:30am - 1:20pm. You will pick one lab time on Friday, 10:00am - 11:50am, 2:00pm - 3:50pm, or 4:00pm - 5:50pm. Class and lab days and times will remain the same throughout the three terms. Another benefit of joining the cohort - know your schedule now! What are the class sizes? Each course will have a maximum of 30-36 students and meet twice a week. Students will also meet once a week in smaller groups of 10-12 students. The smaller group meetings will be run by a former student who has recently completed CS 161, CS 162, and CS 163 and will remain with you throughout your journey in a mentor role. Will I be taking all three courses with the same instructor? Yes! That is one of the benefits of the cohort, developing a relationship with your instructor so they know how to best support you. Will the courses be on the same day and time each term? Yes, you can rely on a consistent day and time each term. I have no prior computer science experience, is this class for me? Yes! This cohort is designed specifically for students with no prior experience. What if I enroll in the cohort sections, but for other reasons, cannot continue with the cohort? We understand that life happens and plans change. If you need to leave the cohort at any time, rest assured you will be prepared to complete the remaining classes outside of the cohort. What will I be learning in the three-course sequence? Take a look at the list of Undergraduate Courses and the specific course descriptions for CS 161 , CS 162 , and CS 163 . I am majoring in another discipline, why should I consider computer science? Technology influences nearly every field of study and impacts almost every aspect of our lives. It is important for all students, regardless of major, to develop real digital competencies alongside their own specialization areas, especially in areas that are increasingly informed by digital and computational environments, such as healthcare, education, and social services. Will there be an annotation or other difference on my transcript indicating that I completed the introductory course sequence within the cohort? No, the course numbers are the same and you will be meeting the same course objectives as the other sections.", "metadata": {"source": "https://pdx.edu/computer-science/discover-cs-cohort", "title": "Discover CS Cohort | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Undergraduate Courses The following list contains all undergraduate courses that can appear on the Computer Science schedule, including selected courses offered by other departments.  (The schedules for the 2023-2024 academic year are available, together with schedules for previous years .)  Please note that some courses are experimental and may not be offered on a regular basis. These may be subject to change each academic year. Required Courses: CS 161 Introduction to Programming and Problem-solving CS 162 Introduction to Computer Science CS 163 Data Structures CS 205 System Programming and Architecture CS 250 Discrete Structures I CS 251 Discrete Structures II CS 302 Programming Methodologies and Software Implementation CS 305 Social, Ethical, and Legal Implications of Computing CS 314 Elements of Software Engineering CS 333 Introduction to Operating Systems ECE 341 Intro. to Computer Hardware CS 350 Algorithms and Complexity CS 358 Principles of Programming Languages CS 469 Software Engineering Capstone I CS 470 Software Engineering Capstone II CS 486 Introduction to Database Management Systems Active Electives: CS 311 Computational Structures CS 415P Parallel Programming CS 418 Cultural Competence in Computing CS 430P Internet, Web, & Cloud Systems CS 431 Introduction to Performance Measurement, Modeling and Analysis CS 435 Accelerated Computing with GPU's and Xeon Phi CS 440 Deep Learning: Computational Structures and Programming CS 441 Artificial Intelligence CS 445 Machine Learning CS 447P Computer Graphics CS 451 Numerical Computation CS 454 Software Engineering CS 457 Functional Programming CS 463 Intro to Web Development CS 464P Front End Web Development CS 465P Full Stack Web Development CS 466 Voice Assistants CS 480 Randomized Algorithms and Probabilistic Analysis CS 485 Cryptography CS 487P Database Management Systems Implementation CS 488P Cloud & Cluster Data Management CS 489 Blockchain Development & Security CS 490 Introduction to Multimedia Computing and Networking CS 491 Introduction to Computer Security CS 492 Malware Reverse Engineering CS 493 Digital Forensics CS 494P Internetworking Protocols CS 495 Web and Cloud Security CS 496 Network Security Special Topic Courses (Active): CS 199 Special Studies: Programming and Problem Solving: A First Exploration CS 299 Special Studies: Algorithmic Thinking CS 410 Top: Advanced Functional Programming CS 410 Top: Advanced Java Programming CS 410 Top: Advanced Topics in Program Verification CS 410 Top: Adventures in Natural Language Processing CS 410 Top: Code Large Language Models CS 410 Top: Code Reading & Review CS 410P Top: Programming Language Compilation CS 410 Top: Computational Photography CS 410 Top: Computer Game Design CS 410 Top: Computer Vision and Deep Learning CS 410P Top: Computers, Sound and Music CS 410 Top: Contemporary Software Development with Java and Android CS 410 Top: Data Clustering CS 410 Top: Data Engineering CS 410 Top: Ethics in Artificial Intelligence CS 410 Top: Exploring Fractals CS 410 Top: Formal Proof Foundations CS 410 Top: Foundations of Computer Vision CS 410 Top: Foundations of Emerging Technologies CS 410 Top: Generative Security Applications CS 410 Top: Introduction to Computational Imaging CS 410 Top: Introduction to Computational Photography CS 410 Top: Introduction to Data Mining CS 410 Top: Introduction to Healthcare Data Analytics CS 410 Top: Introduction to Privacy-aware Computing CS 410 Top: Introduction to Quantum Computing CS 410 Top: Large Language Models CS 410 Top: Mobile and Wireless Networks CS 410 Top: Mobile Health CS 410 Top: Natural Language Processing CS 410 Top: Networked Markets CS 410 Top: Operating System Internals CS 410P Top: Programming Language Compilation CS 410 Top: Proof Assistants and Program Verification CS 410 Top: Reinforcement Learning CS 410 Top: Rust for Small Systems Programming CS 410 Top: Rust Programming CS 410 Top: Rust Web Development CS 410 Top: Secure System Administration and DevOps CS 410 Top: Unconventional Cameras CS 410 Top: Usability Engineering CS 410 Top: Wireless Networks and Applications CS 410 Top: Virtual Reality Other Courses: CS 202 Programming Systems CS 420P Object-Oriented Programming and Design CS 421 Programming Language Implementation: Syntax and Stat CS 422P Programming Language Implementation: Code Generation CS 438 Computer Architecture CS 442P Advanced Artificial Intelligence: Combinatorial Games CS 443 Advanced Artificial Intelligence: Combinatorial Search CS 446 Advanced Topics in Machine Learning CS 452 Building Software Systems with Components CS 461P Open Source Software Development Laboratory CS 462 Advanced Open Source Software Engineering CS 467 The Wireless Web CS 497 Sensor Networks CS 498 Introduction to Wireless Network Protocols Other Special Topics Courses: CS 399 Special Studies: COBOL and Legacy Systems CS 410 Top: Advanced Topics in C++ Programming C S 410 Top: Advanced Topics in Concurrency CS 410 Top: Algorithms Coding CS 410 Top: Generative AI CS 410 Top: Introduction to HCI CS 410 Top: Introduction to Visual Computing CS 410 Top: Languages and Low-Level Programming CS 410 Top: Markets and the Internet CS 410 Top: Modern Agile and Other XP Software Engineering CS 410 Top: Modern Embedded Computing CS 410 Top: Network Security CS 410 Top: Practicum in Asynchronous Systems and Algorithms CS 410 Top: Software Design Patterns CS 410 Top: Spoken Language Interfaces CS 410 Top: Theorem Proving and Program Verification CS 410 Top: Topics in Software Validation CS 410 Top: Unit Test Branching Strategy CS 410 Top: User Interfaces CS 410 Top: Compilers and Interpreters To review course descriptions of previously offered courses, please contact the instructor or review the PSU Bulletin . CS Catalogs 2022-23 2021-22 2020-21 2019-20 2018-19 2017-18 2016-17", "metadata": {"source": "https://pdx.edu/computer-science/undergraduate-courses", "title": "Undergraduate Courses | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Computer Science Strategic Vision Trusted Cities, Technology for the People It is now possible to collect, process, and apply data at an unprecedented scale to solve significant societal problems. While applying computing to improve the overall well-being of people and the cities they live in is desirable, there are also significant concerns: Concern about fairness, equity, transparency, and accuracy when using collected data for automated decision making that impacts people Concern about the security and resilience of the cyber-infrastructure used to collect, transmit, store and manipulate city data as well as the privacy of the individuals in them The Department of Computer Science at Portland State University, with its collaborations across campus centers and with its relationships with local and regional agencies, is well positioned to address these concerns through a concerted effort that exploits its current strengths in data science, machine learning, cyber-security, and high-assurance systems. To this end, we envision Trusted Cities, Technology for the People , an effort that supports transparent, equitable, and reliable computing that improves the health of people and the cities that they live in . Key to our effort is ensuring that the computing infrastructure being developed and deployed is resilient against attack and disaster, maintains the privacy of its citizens, and equally benefits everyone. Further, innovations in technology needs to be human-centered and socially aware, aiding and computing aid in the health, safety, prosperity, and equitable treatment of its inhabitants. To address this problem, foundational components such as security through construction and cybersecurity are needed to ensure that systems are not vulnerable and that they are dependable and trustworthy under extreme circumstances. In addition, to have confidence in deployed systems, the population needs to not only trust the privacy and accuracy of data being gathered but also trust the process of collecting and using the data to derive actions that can potentially impact them. Towards this end, data science and machine learning expertise will ensure that the underlying technologies work as intended, do not treat population segments unequally due to bias within the data itself or within its analysis, and provides a measurable benefit to people. To support this effort, the Department of Computer Science is undertaking multiple educational programs including innovative curricula for cultivating deep disciplinary knowledge and skills, educational outreach that foster participations from underrepresented groups, programs for increasing economic mobility of students, and service learning activities to ensure all of our citizens are well informed on safety, security, and privacy issues being faced.", "metadata": {"source": "https://pdx.edu/computer-science/strategic-vision", "title": "Strategic Vision | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Admission to the CS Major Opt In (Odin Required) about Admission to the CS Major Admission to the Computer Science major is an important step on the path to completing the Bachelor's degree, and is necessary before students can register for most upper division CS courses (i.e., CS 3xx or CS 4xx courses). Admission is guaranteed once the required lower-division courses have been completed, but is not automatic : students must complete the opt-in form linked below (or accessed through the button at the top of this page) to confirm that they wish to be admitted to the CS major. The opt-in form is available for the first eight weeks each term and should be submitted in the term after a student has completed all required lower-division courses. Students who have satisfied the requirements and complete the opt-in during that period will be formally admitted for the following term. We encourage students to complete the opt-in form early so that their requests can be processed before registration opens for classes in the following term. Requirements for Admission to the CS Major Current requirements for admission to the CS major are listed in the PSU Bulletin. Students can use the following steps to verify that they have met these requirements: Navigate to the DARS site . (This can also be accessed from myPSU by selecting the \"Academics\" menu item and scrolling down to the \"Academic Planning\" section.) Make sure the \"audit level\" is set to \"PSU - Undergraduate or Post-bac Audit\" and then click \"Continue\". In the drop-down box for \"Degree Program,\" select \"Computer Science - Admission Requirements - ADMIT-CS\" (make sure you pick the option ending with \"ADMIT-CS\"); select the appropriate catalog year; and then click the \"Run Audit\" button. Your audit report will now be displayed.  To save a copy of the report, click the \"Print/Download\" link to display a printable version, and then use your browser to print or save the report as a PDF file. Completing the Opt-in Form If the message at the top of your ADMIT-CS report is \" All requirements identified below have been met \" (shown in green), then congratulations, you are ready to opt-in!  Be sure to save a copy of the report as a PDF file, and then proceed to fill out the opt-in form (Odin required). If the message at the top of your ADMIT-CS report is \" All requirements are complete using in-progress courses \", then you are making great progress, but will not be able to opt-in until the beginning of the next term. If the message is \" You're making progress: at least 1 requirement remains unmet \", then you are not ready to complete the opt-in at this time, but you can review the items listed in the DARS report to confirm which requirements you have already satisfied, which ones are in progress, and which ones remain to be completed in a future term. Upper Division CS Courses Before Admission Students require at least 56 credits of upper division CS courses (or 52 credits for those using a Catalog from before Fall 2023).  However, there is also a requirement that students must complete at least 44 of those credits after admission .  As a result: Students using the Fall 2023 catalog (or later) can take a maximum of 12 credits (3 courses) of upper division CS classes prior to admission. Students using an earlier catalog can take a maximum of 8 credits (2 courses) of upper division CS classes prior to admission. A limited number of specific upper division CS classes (CS302, CS350, and CS 486) are available to students before admission. Students registering for these courses prior to admission must be careful to avoid exceeding the credit limits described above. Students must have junior standing or higher (90+ credits) to register for these courses. Credits for any other upper division CS courses taken prior to admission (as a result of an approved transfer, for example), will also count towards these limits. Students should generally plan to take these courses in the same term that they complete the opt-in; taking these classes earlier than that may result in a gap in available courses that could delay progress in the major for one or more terms. Students with special circumstances who plan to take any of these courses prior to opt-in should talk to their advisor to ensure they have a plan that will meet their needs. Other courses that students might consider during the term when they opt-in, without impacting the credit limit, include ECE 341, general education courses (arts and letters/social science, or junior cluster courses, for example) or math electives. Questions? Please let us know if you need any help in understanding the requirements or process for admission: Undergraduate and postbac students can email the Undergraduate Adviser at uccs@pdx.edu or arrange a meeting using the information on our advising page . Prospective and/or transfer students may seek guidance to prepare for admission to the CS program through the advising team in the Engineering, Computer Science, Math and Physics Pathway .", "metadata": {"source": "https://pdx.edu/computer-science/undergraduate-admission", "title": "Admission to the CS Major | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Courses The following list contains all graduate courses that can appear on the Computer Science schedule, including selected courses offered by other departments. (The schedules for the 2023-2024 academic year are available, together with schedules for previous years .)  Please note that some courses are experimental and may not be offered on a regular basis. These may be subject to change each academic year. Regular Courses: CS 515 Parallel Programming CS 518 Cultural Competence in Computing CS 530 Internet, Web, & Cloud Systems CS 531 Introduction to Performance Measurement, Modeling and Analysis CS 532 Operating System Foundations CS 533 Concepts of Operating Systems CS 535 Accelerated Computing with GPU's and Xeon Phi CS 538 Computer Architecture CS 540 Deep Learning: Computational Structures and Programming CS 541 Artificial Intelligence CS 545 Machine Learning CS 547 Computer Graphics CS 551 Numerical Computation CS 554 Software Engineering CS 557 Functional Programming CS 558 Programming Languages CS 563 Intro to Web Development CS 564 Front End Web Development CS 565 Full Stack Web Development CS 566 Voice Assistants CS 569 Scholarship Skills for Computer Science & Engineering CS 576 Computer Security Research Seminar CS 577 Modern Language Processors CS 578 Programming Language Semantics CS 580 Randomized Algorithms and Probabilistic Analysis CS 581 Theory of Computation CS 584 Algorithm Design & Analysis CS 585 Cryptography CS 586 Introduction to Database Management Systems CS 587 Database Management Systems Implementation CS 588 Cloud & Cluster Data Management CS 589 Blockchain Development & Security CS 590 Introduction to Multimedia Computing and Networking CS 591 Introduction to Computer Security CS 592 Malware Reverse Engineering CS 593 Digital Forensics CS 594 Internetworking Protocols CS 595 Web and Cloud Security CS 596 Network Security CS 658 Programming Languages CS 669 Scholarship Skills for Computer Science & Engineering CS 676 Computer Security Research Seminar CS 677 Modern Language Processors CS 678 Programming Language Semantics CS 684 Algorithm Design & Analysis Special Topic Courses (Active): CS 510 Top: Advanced Topics in C++ Programming CS 510 Top: Advanced Topics in Concurrency CS 510 Top: Advanced Topics in Program Verification CS 510 Top: Adventures in Natural Language Processing CS 510 Top: Code Large Language Models CS 510 Top: Code Reading & Review CS 510 Top: Programming Language Compilation CS 510 Top: Computational Photography CS 510 Top: Computer Game Design CS 510 Top: Computer Vision and Deep Learning CS 510 Top: Computers, Sound and Music CS 510 Top: Contemporary Software Development with Java and Android CS 510 Top: Data Clustering CS 510 Top: Data Engineering CS 510 Top: Ethics in Artificial Intelligence CS 510 Top: Exploring Fractals CS 510 Top: Formal Proof Foundations CS 510 Top: Foundations of Computer Vision CS 510 Top: Foundations of Emerging Technologies CS 510 Top: Generative Security Applications CS 510 Top: Graphical Models for Optimization and Learning CS 510 Top: Introduction to Computational Imaging CS 510 Top: Introduction to Computational Photography CS 510 Top: Introduction to Data Mining CS 510 Top: Introduction to Healthcare Data Analytics CS 510 Top: Introduction to Privacy-aware Computing CS 510 Top: Introduction to Quantum Computing CS 510 Top: Large Language Models CS 510 Top: Mobile and Wireless Networks CS 510 Top: Mobile Health CS 510 Top: Mobile Health in the COVID Era CS 510 Top: Natural Language Processing CS 510 Top: Networked Markets CS 510 Top: Operating System Internals CS 510 Top: Programming Language Compilation CS 510 Top: Proof Assistants and Program Verification CS 510 Top: Reinforcement Learning CS 510 Top: Rust for Small Systems Programming CS 510 Top: Rust Programming CS 510 Top: Rust Web Development CS 510 Top: Secure System Administration and DevOps CS 510 Top: Unconventional Cameras CS 510 Top: Usability Engineering CS 510 Top: Wireless Networks and Applications CS 610 Top: Computational Photography CS 610 Top: Graphical Models for Optimization and Learning CS 510 Top: Virtual Reality Other Courses: CS 520 Object-Oriented Programming and Design CS 542 Advanced Artificial Intelligence: Combinatorial Games CS 543 Advanced Artificial Intelligence: Combinatorial Search CS 546 Advanced Topics in Machine Learning CS 549 Computational Geometry CS 550 Parallel Algorithms CS 552 Building Software Systems with Components CS 553 Design Patterns CS 555 Software Specification and Verification CS 556 Software Implementation and Testing CS 559 Software Measurement & Models CS 560 Human-Computer Interaction CS 561 Open Source Software Development Laboratory CS 562 Advanced Open Source Software Engineering CS 567 The Wireless Web CS 568 Functional Logic Programming CS 570 Machine Learning Seminar CS 572 Operating System Internals CS 575 Computer Systems Analysis CS 579 Formal Verification of Hardware/Software Systems CS 582 Theory of Computation: Advanced Topics CS 583 Automata and Formal Languages CS 597 Sensor Networks CS 598 Introduction to Wireless Network Protocols CS 653 Design Patterns CS 655 Software Specification and Verification CS 656 Software Implementation and Testing CS 659 Software Measurement & Models CS 668 Functional Logic Programming CS 672 Operating System Internals Other Special Topic Courses: CS 510 Top: Advanced Functional Programming CS 510 Top: Advanced Java Programming CS 510 Top: Algorithms Coding CS 510 Top: Generative AI CS 510 Top: Introduction to HCI CS 510 Top: Introduction to Visual Computing CS 510 Top: Languages and Low-Level Programming CS 510 Top: Markets and the Internet CS 510 Top: Modern Agile and Other XP Software Engineering CS 510 Top: Modern Embedded Computing CS 510 Top: Network Security CS 510 Top: Practicum in Asynchronous Systems and Algorithms CS 510 Top: Software Design Patterns CS 510 Top: Spoken Language Interfaces CS 510 Top: Theorem Proving and Program Verification CS 510 Top: Topics in Software Validation CS 510 Top: Unit Test Branching Strategy CS 510 Top: User Interfaces CS 510 Top: Compilers and Interpreters To review course descriptions of previously offered courses, please contact the instructor or review the PSU Bulletin . CS Catalogs 2021-22 2020-21 2019-20 2018-19 2017-18 2016-17 2022-23", "metadata": {"source": "https://pdx.edu/computer-science/node/111", "title": "Graduate Courses | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Postbaccalaureate Computer Science Programs Postbaccalaureate Are you looking for career change in the field of Computer Science? Whether you are thinking about pursuing a second bachelor’s or master’s degree, Portland State University offers multiple paths to our Computer Science programs. These paths are reserved for students who have previously earned an accredited bachelor’s degree in a field other than Computer Science. Second Bachelor's Degree Earn a Bachelor of Science in Computer Science Broader topical coverage than Master's program Begin any term Must complete all undergraduate major requirements Must maintain a C or better Completed in as little as four years Bachelor Requirements Grad Prep Program Provides preparatory work necessary to enter the CS Master's program BA and BS degree holders welcome Begin any term 32-40 credits of Computer Science undergraduate coursework Must maintain a B or better Completed in as little as 12 months + time required for Masters Grad Prep Requirements To learn more about these options, prospective students can attend one of our monthly CS Postbac Information Sessions . These sessions are scheduled approximately once a month (currently using Zoom) and begin at 3:30pm Pacific Time. A link to the Zoom meeting will be sent 24 hours before the session. Students are encouraged to review the slides that are presented at our Postbac Information Sessions, and contact the CS Graduate Advisor ( gccs@pdx.edu ) with any questions. 8.3.4", "metadata": {"source": "https://pdx.edu/computer-science/postbaccalaureate", "title": "Postbaccalaureate | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Master's Track Courses As part of the degree requirements for the CS Master's program, students must complete three courses from one of the following tracks: Artificial Intelligence & Machine Learning Databases Languages & Programming Security Software Engineering Systems & Networking Track substitutions with other courses in the topic area may be permitted with the approval of the CS Graduate Advisor ( gccs@pdx.edu ). Artificial Intelligence & Machine Learning The Artificial Intelligence and Machine Learning track covers modern algorithms underlying intelligent and learning systems. Examples of topics covered in courses on this track include knowledge representation, planning, reasoning, combinatorial and adversarial search methods, natural language processing, computer vision, statistical machine learning, and evolutionary and reinforcement learning. CS 541 Artificial Intelligence (3) CS 545 Machine Learning (3) One course from the following: CS 542 Advanced Artificial Intelligence: Combinatorial Games (3)** CS 543 Advanced Artificial Intelligence: Combinatorial Search (3)** CS 546 Advanced Topics in Machine Learning (3) ** CS 570: Machine Learning Seminar (3) STAT 671: Statistical Learning I (3) STAT 672: Statistical Learning II (3) STAT 673: Statistical Learning III (3) SYSC 557 Artificial Life (4) OHSU CS 623 Deep Learning (3)* OHSU CS 562 Natural Language Processing* OHSU 5/692 Ethics in AI and Machine Learning Research* Any approved CS 510 Course in AI or Machine Learning *Courses taken through the Joint Campus Program are considered transfer courses. Databases The Database track covers concepts, languages, implementation and application of  database management systems. Other topics that have been offered in the track include formal  foundations of databases, databases for cloud and cluster environments, and data stream systems. CS 586 Intro to Database Management Systems (3) Two courses from the following: CS 530 Internet, Web, & Cloud Systems (3) CS 587 Database Management System Implementation (3) CS 588 Cloud & Cluster Data Management (3) CS 589 Principles of Database Systems (3)** Any approved CS 510 course in Databases Languages & Programming The Languages & Programming track focuses on the design, implementation, and use of programming languages. It includes exposure to a variety of programming paradigms, experience using programming languages to express the essential abstractions of a problem domain, courses on programming language implementation, and the study of formal methods for specifying and reasoning about programs and programming languages. CS 558 Programming Languages (3) Two courses from the following: CS 515 Parallel Programming (3) CS 520 Object Oriented Programming (3)** CS 553 Design Patterns (3) CS 557 Functional Languages (3) CS 568 Functional Logic Planning (3)** CS 577 Modern Language Processors (3) CS 578 Program Language Semantics (3)** Any approved CS 510 course in Languages & Programming Security The Security track focuses on protecting computing systems and user data from unauthorized access and use.  Topics include cryptography, network and host-based access control, vulnerability analysis, penetration testing, and reverse engineering. CS 591 Introduction to Computer Security (3) Two courses from the following: CS 530 Internet, Web, & Cloud Systems (3) CS 576 Computer Security Seminar (3)** CS 585 Cryptography (3) CS 592 Malware Reverse Engineering (3) CS 593 Digital Forensics (3)** CS 595 Web and Cloud Security (3) CS 596 Network Security (3) Any approved CS 510 course in Security Software Engineering The Software Engineering track studies the principles, processes, techniques, and tools for building software systems.  Topics include software requirement, design, development, validation, and maintenance. CS 554 Software Engineering (3) Two courses from the following: CS 530 Internet, Web, & Cloud Systems (3) CS 552 Building Software Systems w/ Components (3)** CS 553 Design Patterns (3) CS 555 Software Specification & Verification (3)** CS 556 Software Implementation and Testing (3)** CS 561 Open-source Software Development (3) CS 565 Full Stack Web Development (3) Any approved CS 510 course in Software Engineering Systems & Networking The Systems and Networking track studies the design and implementation of operating systems, wired and wireless computer networks including high performance computer systems, data centers, cloud computing architectures, distributed systems, fault tolerance, concurrency, systems programming, and theoretical topics related to these areas. CS 533 Concepts of Operating Systems (3) CS 594 Internetworking Protocols (3) One course from the following: CS 515 Parallel Programming (3) CS 530 Internet, Web, & Cloud Systems (3) CS 531 Introduction to Performance (3) CS 535 Accelerated Computing (3) CS 538 Computer Architecture (3) CS 572 Operating Systems Internals (3)** CS 590 Introduction to Multimedia Computing and Networking (3) CS 598 Introduction to Wireless Network Protocols (3) ECE 586 Computer Architecture (4) Any approved CS 510 course in Systems & Networking *CS 532 does not count towards the track", "metadata": {"source": "https://pdx.edu/computer-science/masters-track-courses", "title": "Master's Track Courses | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Forms and Policies Apply to a Computer Science Program Bachelor/Minor/Biomedical Grad Prep Master/Doctoral Undergraduate Program Policies Course Prerequisites Before enrolling in any Computer Science course, students should read the course description and ensure that they have completed all prerequisites with a grade of C or better. Students who have not met this requirement may be administratively dropped from the course. Continuation Criteria Admitted CS undergraduate students who are not making acceptable progress towards their degree requirements will be dropped from the program and required to reapply for admission. Acceptable progress is defined as completion of at least 8 credits of coursework with acceptable grades (C or better for required CS courses, C- or better for required non-CS courses) satisfying departmental requirements, over the preceding 12 months. Readmission will be determined by the CS Appeals Committee. Differential Tuition Undergraduates admitted to the CS program will be assessed tuition at the Undergraduate Engineering rate (see “Differential Programs-Undergraduate” in the PSU fee schedule).  Post Baccalaureate students will be assessed tuition at either the Undergraduate or the Graduate Engineering rate, depending upon the level of course taken. Graduate Program Policies Planning your Course of Study All newly admitted Masters students work with the Graduate Advisor to develop a plan of study.  Doctoral students are assigned additional faculty members to make up a preliminary Ph.D. committee. When you begin research work on a Ph.D. dissertation, or if you choose to do a master's project or thesis, you should change your adviser to the person who will supervise this process. Your adviser must be a full-time faculty member. You may change advisers, but since the new adviser must agree to the change, and there are PSU regulations about advising duties (particularly for doctoral degrees), you must make sure that any change has been properly recorded and processed by the CS Office. When you apply for graduation, your current adviser must approve your program, and is not necessarily bound by the decisions of a different, earlier adviser. For this reason it is recommended that students discuss their study plans with advisers regularly. Course Load Full-time graduate students typically take 9 credits per term. Approval is required to register in 11 credits or more. To request this, complete the Overload Approval form and submit it to your adviser. Part-time students are defined as those taking fewer than 9 credits per term. Teaching and research assistants are required to complete at least 9 graduate credits each quarter with a grade of B- or better, or a Pass; some of these can be CS 501 (Research) credits that will not count toward the credits required for a degree, and should normally be graded Pass/No-Pass. International students must normally take a minimum of at least 9 credits per term to maintain their status, but there are some exceptions. Information and help on this topic may be found here . Pass/No Pass Usually, other than specifically designated independent study or research classes, courses graded Pass/No-Pass cannot be used toward a graduate degree. Classes taken Pass/No-Pass at PSU (prior to admission) or other institutions may not be transferred for credit. Leaving the Program If you are unable to register for any coursework during a given term, it is your responsibility to inform the CS Department and the Office of Graduate Studies. For details, see the sections on Leave of Absence or Cancellation of Admission and Re-enrollment in the PSU Bulletin. Minimum Grade Point Average Students in the graduate program must maintain a 3.00 cumulative GPA and a 2.70 term GPA at all times. Any student who has a cumulative GPA below 3.00 at the end of a term (based on at least 9 credits), or a term GPA below 2.70 (based on at least 6 credits) will be put on academic probation. A student who has been placed on probation and subsequently violates these GPA limits will be terminated from the University. Forms Undergraduate Programs Graduate Programs Jobs & Internships PCC Articulation Agreement about CS 199/161/162 Comparison about CS 162 Expected Prep Guide about Graduate Course Approval about Waiver of CS requirements about Honors Track Application about Incomplete Policy & Contract about CPL Policy about MS Plan of Study about Ph.D. Plan of Study about Advisor Change Form about Internship Approval Form about Internship Status Report about RPE Check List about RPE Result Report about CS Grader Application about CS TA Application about PCEP Internship about MECOP Internship about", "metadata": {"source": "https://pdx.edu/computer-science/forms-and-policies", "title": "Forms and Policies | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Computer Science Research The department has a number of active research areas. Please see the individual faculty web pages for more information about each research area. Artificial Intelligence & Machine Learning Ameeta Agrawal Ehsan Aryafar Bart Massey Banafsheh Rekabdar Suresh Singh Computer Science Education Wu-chang Feng Jim Hook Karen L. Karavanic Computer Security & Privacy Nirupama Bulusu Wu-chang Feng Jim Hook Karen L. Karavanic Fang Song Andrew Tolmach Primal Pappachan Read more about Cybersecurity at PSU . Computer Vision & Computer Graphics Wu-chi Feng Feng Liu Banafsheh Rekabdar Atul Ingle Read more about the Computer Graphics & Vision Lab . Read more about the Computational Imaging Lab. Data Science Ehsan Aryafar David Maier Banafsheh Rekabdar Kristin Tufte Kunpeng Liu Primal Pappachan Read more about the Database Reading Group . HPC Karen L. Karavanic Natural Language Processing Ameeta Agrawal Programming Languages & Formal Methods Andrew Black Jim Hook Mark Jones Bart Massey Andrew Tolmach Software Engineering Warren Harrison Bart Massey Fei Xie Systems & Networking Ehsan Aryafar Nirupama Bulusu Wu-chang Feng Wu-chi Feng Karen L. Karavanic Suresh Singh Primal Pappachan Theory Fang Song Shravas Rao Sayan Bandyapadhyay", "metadata": {"source": "https://pdx.edu/computer-science/research-areas", "title": "Computer Science Research | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Assistantships Computer Science Graduate Assistants (GAs) are graduate students who are hired to perform instructional, research, or administrative duties for the department. Graduate Assistants at Portland State University are represented by the PSU Graduate Employees Union, AFT/AAUP. Teaching Assistantships A limited number of teaching assistantships are available to our best-qualified graduate students. These assistantships are granted for one term at a time, and are renewable based on the student's performance in coursework and TA responsibilities. A teaching assistantship pays a monthly stipend and a tuition remission. The student might teach a course under the supervision of a faculty member or grade papers for approximately 15-20 hours per week. Our selection process for teaching assistants are similar to those used for graduate admission : grades, references, plus evidence of teaching experience or ability. Please note that a PSU Odin account is required to access the application. Apply for TA-ship about this content Research Assistantships Faculty in the department have research grants that support research assistants (RAs). Faculty members choose RAs on an individual basis, but the most important criterion is the student's ability to contribute to the professor's research program. Ordinarily, students are given a research assistantship only after they have been in the graduate program for at least one term and have taken at least one class from the professor. After advancing to candidacy (see doctoral program), doctoral students are normally supported by a research assistantship with their dissertation adviser and may be able to use the work supported by the assistantship as a part of their own research.", "metadata": {"source": "https://pdx.edu/computer-science/graduate-assistantships", "title": "Graduate Assistantships | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Supporting the Computer Science Department Make a Gift Today! Give to PSU Give to MCECS Give to CS The Maseeh College is committed to providing students with opportunities to pursue higher education, fueling their creativity to develop new ideas from proposal to prototype, and responding to urgent needs. Our high-quality educational programs are sustained through the generosity of alumni and friends. Join us in supporting the next generation of engineers and computer scientists by making a contribution today. Online giving is possible through the PSU Foundation website. Please visit https://www.psuf.org/ , for more information. Matching gifts Many employers sponsor matching gift programs and will match charitable contributions made by their employees. Some companies match gifts made by retirees and/or spouses. With matching gifts you can sometimes double or even triple your gift! Determine if your company has a matching gift policy .  If it does, you may request a matching gift form from your employer and send it completed and signed to the PSU Foundation . We'll take care of the rest!", "metadata": {"source": "https://pdx.edu/computer-science/support", "title": "Supporting the Computer Science Department | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Statement from the Chair When I was first learning about computer science, it was tempting to think that technology was all that mattered: the programming languages, algorithms, and operating systems; the hardware that they run on; the networks that connect everything; and all of this working together in some pure, mechanical fashion to accomplish a broad set of goals. As I've grown older, I've come to realize that we should pay more attention instead to the people, including those who build and operate our systems, as well as those whose lives are impacted by the ways that they are used. As computer scientists, we often celebrate the innovations that have been driven by the visions of industry or intellectual leaders; by chance interactions and meetings between small groups of individuals; or by the efforts of larger teams working together, whether in a small garage, a tech start up, or a larger company. Embarrassingly, we have not been as willing to recognize or counter the presence of systemic issues in our field that work to exclude, diminish, or discourage the participation of many people who do not fit the cultural stereotypes for what it means to be a computer scientist. This is not a matter for debate. If you have any doubt, then picture the days, not so long ago, when you might have found yourself in a classroom filled with computer science students, and consider whether the people you would see there are truly representative of the society that we see outside. In recent days, we have witnessed protests and deep unrest, both locally and around the globe, that have drawn attention, once again, to pervasive systemic racism and injustice. It is a deeply uncomfortable reality that many of the people around us, even when they live in the same place, with supposedly the same facilities and opportunities, will nevertheless experience our same world in very different ways. Many of these differences can be traced to differences in the color of a person's skin, and to a long and ugly history surrounding the ways in which people of different races have been treated. This is unacceptable, and it is important to state, not as a slogan that is easily said, but as a personal commitment and focus for my own work, that Black Lives Matter. What can a department like ours do to address the issues that people of color, and those in other underrepresented groups, have to deal with on a daily basis in computer science? I believe that our obligations begin with the need to listen very carefully to understand the experiences of those around us, both in our immediate community, and further away. But we also need to learn from what we hear, and to be proactive in reaching out to improve our education and understanding of these critical topics. Beyond that, but most critically, we need to act , with empathy and urgency; every one of us has an important role to play in working to build the only kind of future that is acceptable, where everyone's participation is welcome, and everyone's contributions and accomplishments are properly recognized. The task ahead is daunting and challenging. It will require dedication and perseverance, and, for many of us, a significant investment of time and energy as we confront unpleasant truths and rethink the way that we structure and conduct our work. In my role as chair, I pledge to make this a top priority for me and for the department. Many of you may have personal insights, recommendations, or criticisms that might help inform our work. I urge you to share those with me, and I promise that I will listen with openness, humility, and a commitment to act on what I learn. But building a fair and equitable future for everyone in computer science will be the biggest innovation that our discipline can deliver, and every one of us has a key role to play in making that a reality. Thank you and best wishes, Mark ( mpj@pdx.edu )", "metadata": {"source": "https://pdx.edu/computer-science/chair-statement", "title": "Statement from the Chair | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Bachelor of Science The Bachelor of Science in Computer Science is the first university degree in the field and may take at least four years of full-time work to complete. Students may enter the program directly from high school; after preliminary coursework in a two-year community college program; or after they have work experience in the field without a college degree. The department makes every effort to place students in courses appropriate to their actual level of knowledge. Note that these courses reflect the requirements for the most recent catalog (also known as the PSU Bulletin). For earlier catalogs and inquiries regarding degree requirements, please consult with an Advisor for more information. CS Course Requirements All computer science courses must be graded C or better. CS 161 Introduction to Programming and Problem-solving (4) CS 162 Intro to Computer Science (4) CS 163 Data Structures (4) CS 205 System Programming and Architecture (4) CS 250 Discrete Structures I (4) CS 251 Discrete Structures II (4) CS 302 Programming Methodologies and Software Implementation (4) CS 305 Soc/Eth/Leg Impl Computing (2) CS 314 Elements of Software Eng (4) CS 333 Intro to Operating Systems (4) CS 350 Algorithms and Complexity (4) CS 358 Principles of Prog Lang (4) CS 486 Intro to Database Systems (4) CS 469 Software Eng Capstone I (3) CS 470 Software Eng Capstone II (3) CS Upper Division Programming Intensive elective** (4) CS Upper Division Security elective** (4) Other CS Upper Division electives** (16) Non-CS Course Requirements Courses taken outside the department must be graded C- or better. COMM 220 Public Speaking (4)* WR 227 Technical Writing (4) MTH 251 Calculus I (4) MTH 252 Calculus II (4) MTH 253 Calculus III or MTH 261 Intro. to Linear Algebra (4) ECE 341 Computer Hardware (4) Approved Lab Science (15)** Approved Mathematics Electives (7)** *Waived for students who have taken Freshman Inquiry ** There are several categories of required electives, including Programming Intensive, Security, Lab Science, and Mathematics electives. Please see the Bulletin for details about which courses are approved for each category. University Requirements The General Education requirements for CS students can be met in one of two ways. Students who complete their entire program at PSU meet the requirement by taking 39 credits of University Studies and the Computer Science Capstone. Students transferring from community colleges having co-admission agreements with PSU (currently Clackamas Community College, Mount Hood Community College, and Portland Community College) may follow this path. Transfer students must have a minimum of 39 credits as a combination of University Studies courses and Liberal Arts / Social Science transfer credits. 12 of these credits must be upper division cluster courses taken at PSU. Beginning with the 2022-23 catalog, all Portland State undergraduate students must fulfill the Race and Ethnic Studies requirement (RESR) to earn their bachelor's degrees. Course Prerequisites Before enrolling in any Computer Science course, students should read the course description and ensure that they have completed all prerequisites with a grade of C or better. Students who have not met this requirement may be administratively dropped from the course. The prerequisites for each required CS course can be viewed in graphical form for both the 2022-23 and 2023-24 academic years.  In these diagrams, an arrow points to the courses that require the prerequisite. CS Upper Division Electives Registration for 300-level and 400-level CS courses requires admission to the CS Upper Division program. CS Upper Division electives can be any 300-level and 400-level CS courses including CS 410 and/or ECE 455, ECE 456, ECE 485, and ECE 486. A total of 24 credits of CS Upper Division electives are required.  At least one of these electives must be a Programming intensive course (noted by a P suffix on the course number).  And at least one of these electives must be an approved Computer Science Security elective (currently CS 491, CS 495, or CS 496). A maximum of 4 credits may count from CS 309, CS 401, CS 405, CS 406, CS 407, and CS 409. CS 404 and any courses specifically described as not being applicable to the CS degree may not be used. 44 of the 52 Upper Division CS credits must be taken at PSU after admission to the CS Program. Postbaccalaureate Postbac students working toward a second bachelor's degree must satisfy all required CS and Non-CS courses listed above, but are not required to take free electives or to satisfy the general University requirements. Courses taken for the first undergraduate degree may be used to satisfy these requirements, provided the student takes at least 45 credits at PSU. For example, a student with an undergraduate degree in physics or electrical engineering will have likely satisfied most or all of the science and math requirements while one with a major in literature or fine arts will likely need to take more courses to earn the CS degree. Sample Possible 4-year Schedule Sample schedules for completing the degree are available in the form of a degree map: 2023-24 2022-23 Previous versions of the sample schedule have been referred to as the \"blue sheet\" because they were customarily printed on blue paper. Click the links below to see the blue sheet for the corresponding years. 2022-23 2020-21 (also 2021-2022) 2019-20 2018-19 2017-18 2016-17 2015-16 Graduation Procedure Students must apply two terms prior to their expected date of completion. The online graduation application is available on myPSU. Details and specific deadlines for degree applications are published on the Office of Registrar page.", "metadata": {"source": "https://pdx.edu/computer-science/bachelor", "title": "Bachelor of Science | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "About The Department of Computer Science at Portland State University offers students and faculty a community to learn, discover, innovate, and share a curriculum based on the application and theoretical foundations of Computer Science. The department provides many resources for our students with 26 regular faculty members who specialize in a variety of research areas and a dedicated staff to advise our multiple programs of study. We offer undergraduate (BS) and graduate (MS, Ph.D.) degrees, a minor, a computer security certificate, and a collaborative degree in Biomedical Informatics with OHSU. We have over 800 undergraduate CS majors and almost 200 graduate students, including more than 30 Ph.D. students. Partnering with various local tech companies, the Department has developed a cooperative education program (PCEP) that provides both an educational and professional experience that is unique to only our students. We also participate in the industry-sponsored MECOP internship program. In addition, many students find their own internships among the many high-tech companies in our area, sometimes called the “Silicon Forest”. With many opportunities for our students, we encourage internships as a great complement to formal learning. We invite you to join our Computer Science community as a student, colleague, alumni, affiliate, or a friend. Welcome to the Maseeh College Computer Science Department! Mission Statement The mission of the Computer Science Department is to work effectively and collegially to create, apply, and impact knowledge in computing, software, and information technologies through accessible education programs, relevant and collaborative research, and service to the profession and local, national, and global communities.", "metadata": {"source": "https://pdx.edu/computer-science/about", "title": "About | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Research Proficiency Examination Every Ph.D. student is required to take the Research Proficiency Exam (RPE) by the end of their second year at PSU. This will satisfy the comprehensive exam requirement, which measures a Ph.D. student's knowledge within their domain of research. Years are counted from the term in which the student enters the Ph.D. program. Extensions to the two-year period may be granted by a Ph.D. student's advisory committee in consultation with the CS director of graduate studies. Part-time students may routinely obtain an extension to three years. Note, the university limit is 5 years if entering with a MS degree and 7 years otherwise. Students must be registered for a minimum of 1 graduate credit in each term they are taking or working on the RPE. The RPE exam consists of a written research paper and an oral presentation: With the approval of the CS director of graduate studies, a Ph.D. student is assigned to a 3-person committee created by the student’s faculty advisor. The committee members must be knowledgeable in the research area. If appropriate, one member of the committee may be a faculty member from a different department or institution. The Ph.D. student conducts research on a problem and writes a paper that is in a form appropriate for publication at a conference or workshop in that research area. Standard formatting can be used as appropriate for that area. The student schedules the RPE presentation with the RPE committee. Presentations can take place at any time during the academic year, and do not need to be coordinated with each other. The presentation is open to all and the paper must be circulated to the faculty a week before the presentation. The presentation is 45 minutes for the talk followed by 15 minutes for questions. The format is that of a typical technical talk that first motivates the problem, then describes related work, followed by the research contributions. The RPE committee decides on a Pass/Fail/Retake: A pass needs to be agreed upon unanimously by the RPE committee. In case of a retake, the student needs to address the committee's feedback and retake the exam within six months. The exam can only be taken twice. Relevant Documents RPE Checklist - To be filled out at the time of applying to take the RPE. RPE Result Report - Used by an RPE committee to report the result of the exam.", "metadata": {"source": "https://pdx.edu/computer-science/research-proficiency-examination", "title": "Research Proficiency Examination | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Computer Science Department Programs Bachelor Master Doctoral CS Advising Undergraduate Courses Graduate Courses Student Resources Forms & Policies PCEP Internship Contact Computer Science Department Computer Science Department Office Hours: 9:00am - 5:00pm Students can drop off documents for staff and faculty at Locker 18 at the Fishbowl. Email : csoffice@pdx.edu Phone: 503-725-4036 Address Physical Address: 1900 SW 4th Avenue, Suite 120 Portland, OR 97201 Mailing Address: Computer Science Department Portland State University PO Box 751 Portland, OR 97207-0751 CONTACT US Undergraduate Advising: uccs@pdx.edu Graduate Advising And Graduate Admissions: gccs@pdx.edu Department Services Coordinator: elisa24@pdx.edu Department Manager: sarreal@pdx.edu Department Chair: mpj@pdx.edu CS Office: csoffice@pdx.edu", "metadata": {"source": "https://pdx.edu/computer-science/contact", "title": "Contact | Portland State University", "description": "CONTACT USUndergraduate Advising: uccs@pdx.eduGraduate Advising And Graduate Admissions: gccs@pdx.eduDepartment Services Coordinator: elisa24@pdx.eduDepartment Manager: sarreal@pdx.eduDepartment Chair: mpj@pdx.eduCS Office: csoffice@pdx.edu", "language": "en"}, "type": "Document"}, {"page_content": "Student Resources Computer Science Tutors CS Tutors are available to assist students in CS 161 through CS 311 with cousework, programming, and the MCECS computing environment. CS Tutors are located in suite 88 in the basement of the Fourth Avenue Building (the “CS Lounge”). MCECS Lockers The Maseeh College of Engineering and Computer Science (MCECS) provides rental lockers for current students for $12.50 per term. Register online at the Maseeh College Self-Service Portal. A CECS username and password are required to access the site. Computer Action Team The CAT (Computer Action Team) provides IT support throughout MCECS. With a primary focus on instructional needs, the CAT supports many large scale computer labs, remotely accessible compute/session servers, various remotely accessible services and the server and physical network infrastructure that binds it all together. We in Computer Science WICS aim to create opportunities that inspire and celebrate the participation and accomplishments of LGBTQIA+ people, women, gender non-conforming, first-generation immigrants, people of color, and disabled people. ACM Student Chapter The Association for Computing Machinery (ACM) is the world's largest educational and scientific computing society. The ACM Student Chapter facilitates communication and collaboration within the local computing community by organizing events throughout the year, including lectures and gaming nights. Maseeh College Ambassadors The Maseeh College Ambassadors are a team of engineering and computer science students who lead tours, lab visits, and hands-on activities for the purpose of visualizing STEM in action and the diverse people who do it. Other Resources Student Resources Campus Resources Resource Centers Jobs & Internships MCECS Career Services about PSU Career Services about Learning Center about Writing Center about Tech Suppport about Library about IELP Tutoring about Education Abroad about MCECS Scholarships about Student Health & Counseling about Campus Security about Student Legal Services about University Housing about Student Recreation about Student Finance about Cultural Resource Centers about Disability Resource Center about Queer Resource Center about Students with Children about Veterans Services about Women's Resource Center about CS Grader Application about CS TA Application about PCEP Internship about MECOP Internship about", "metadata": {"source": "https://pdx.edu/computer-science/student-resources", "title": "Student Resources | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Admission The Master of Science (M.S.) is the first graduate degree in the field. Students entering the program must have a bachelor's degree and/or adequate background in computer science, such as obtaining an undergraduate computer science program. The Doctor of Philosophy (Ph.D.) is the highest degree offered in any discipline. Students may enter the doctoral program with a bachelor's degree or with a master's degree, and must have adequate background in computer science. Application Deadlines The official deadlines for submission of all materials to the University are as follows: Fall Term 2024 (September start) : March 1st Priority for PhD program: December 15th Winter Term 2025 (January start) : September 15th Spring Term 2025 (April start) : November 1st PSU operates on a quarter system. For future or specific term dates, refer to the PSU Academic Calendar . Please note that these are the dates that the online application closes for the specified term. The application must be submitted by this date. Supporting documents such as test scores and recommendations may arrive after this deadline. Financial support, when offered, typically starts in Fall term. The deadlines for international students are anticipated to account for the time required to obtain visas. Applications should be received by the deadline of the term of admission. Incomplete applications will not be reviewed, so applicants are encouraged to complete all requirements prior to submitting the application. If you are unable to do so, please contact the Graduate Advisor ( gccs@pdx.edu ). Admission Requirements To be considered for admission, all applicants to the CS graduate programs must have: A four-year baccalaureate degree from an accredited institution 1 Minimum undergraduate GPA of 3.0 Proof of English Language Proficiency for International Students The GRE Requirement has been waived through Spring 2025 Graduate Record Examination (GRE) Scores Prospective graduate students are not required to have a Bachelor's degree in Computer Science, but they must make up the background needed for graduate study before applying for admission. See the Grad Prep page for more details. Minimum acceptance: 60th percentile in Quantitative and 25th percentile in Verbal. PhD applicants are expected to be above the minimum. GRE will be waived for an MS applicant if the student completes the Grad Prep program . Admission is selective and meeting minimum requirements does not guarantee admission. All admission decisions are based on the information a prospective student provides. Please contact the Graduate Advisor ( gccs@pdx.edu ) if you would like to discuss your specific situation. Admission Timeline Admission decisions are typically issued about 6-8 weeks after the application deadline (listed above) for complete applications. For applications that are incomplete after the deadline, admission decisions will be issued 6-8 weeks after all required documents have been received. Application Requirements Login or create a new account in the PSU application portal to start a single online application to Portland State University and to a CS graduate program. You will be able to save an incomplete application and return at a later time. Be prepared to submit the requested documents electronically before proceeding to the online application; do not mail any hard copies to the CS department. Please note – do not submit screenshots, photos, or participation certificates for extra-curriculars. For any questions about the online application form, please contact help@applyweb.com . For any questions regarding CS graduate admission, please contact the CS Graduate Advisor ( gccs@pdx.edu ). GRE Score Reports The GRE Requirement has been waived through Spring 2025 Official GRE scores will be required upon admission to a CS graduate program. If you do not have a copy to upload electronically, official copies can be requested from ETS and sent to School code 4610 and Department code 0402. If you have previously taken the GRE as part of another application to a graduate program at a U.S. institution, please contact the CS Graduate Advisor ( gccs@pdx.edu ). The GRE requirement for PhD applicants will only be waived by the admission committee under exceptional circumstances. Transcripts The CS graduate programs require copies of transcripts from each postsecondary institution you have attended (including PSU). Unofficial transcript copies are acceptable for application purposes. Official copies are required upon admission to the program. For more information, see PSU’s transcript requirements . References Contact information for two references are required, preferably those who know your academic performance and potential. Recommendation letters are also acceptable and can be submitted to the CS Graduate Advisor ( gccs@pdx.edu ). Short Personal Statement In 1-2 pages, introduce yourself, your plans, interests, and qualifications. This statement should include your background and interests in computer science, any relevant work experience, why you are seeking a graduate degree, and whether you plan to enroll part-time or full-time. If you plan to enroll part-time, describe your employment or major activities as well. If you are applying for immediate admission to the PhD program, include a description of your potential research area, faculty members you hope to collaborate, and your reasons for not entering the CS master’s program. English Language Proficiency Test Score Reports For international students only, please review the English Language Proficiency requirement webpage for more information about which tests are accepted, and what the minimum score requirements are. If a test score report copy is not available, please list the date the test was taken or will be be taken.", "metadata": {"source": "https://pdx.edu/computer-science/graduate-admission", "title": "Graduate Admission | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Courses The following list contains all graduate courses that can appear on the Computer Science schedule, including selected courses offered by other departments. (The schedules for the 2023-2024 academic year are available, together with schedules for previous years .)  Please note that some courses are experimental and may not be offered on a regular basis. These may be subject to change each academic year. Regular Courses: CS 515 Parallel Programming CS 518 Cultural Competence in Computing CS 530 Internet, Web, & Cloud Systems CS 531 Introduction to Performance Measurement, Modeling and Analysis CS 532 Operating System Foundations CS 533 Concepts of Operating Systems CS 535 Accelerated Computing with GPU's and Xeon Phi CS 538 Computer Architecture CS 540 Deep Learning: Computational Structures and Programming CS 541 Artificial Intelligence CS 545 Machine Learning CS 547 Computer Graphics CS 551 Numerical Computation CS 554 Software Engineering CS 557 Functional Programming CS 558 Programming Languages CS 563 Intro to Web Development CS 564 Front End Web Development CS 565 Full Stack Web Development CS 566 Voice Assistants CS 569 Scholarship Skills for Computer Science & Engineering CS 576 Computer Security Research Seminar CS 577 Modern Language Processors CS 578 Programming Language Semantics CS 580 Randomized Algorithms and Probabilistic Analysis CS 581 Theory of Computation CS 584 Algorithm Design & Analysis CS 585 Cryptography CS 586 Introduction to Database Management Systems CS 587 Database Management Systems Implementation CS 588 Cloud & Cluster Data Management CS 589 Blockchain Development & Security CS 590 Introduction to Multimedia Computing and Networking CS 591 Introduction to Computer Security CS 592 Malware Reverse Engineering CS 593 Digital Forensics CS 594 Internetworking Protocols CS 595 Web and Cloud Security CS 596 Network Security CS 658 Programming Languages CS 669 Scholarship Skills for Computer Science & Engineering CS 676 Computer Security Research Seminar CS 677 Modern Language Processors CS 678 Programming Language Semantics CS 684 Algorithm Design & Analysis Special Topic Courses (Active): CS 510 Top: Advanced Topics in C++ Programming CS 510 Top: Advanced Topics in Concurrency CS 510 Top: Advanced Topics in Program Verification CS 510 Top: Adventures in Natural Language Processing CS 510 Top: Code Large Language Models CS 510 Top: Code Reading & Review CS 510 Top: Programming Language Compilation CS 510 Top: Computational Photography CS 510 Top: Computer Game Design CS 510 Top: Computer Vision and Deep Learning CS 510 Top: Computers, Sound and Music CS 510 Top: Contemporary Software Development with Java and Android CS 510 Top: Data Clustering CS 510 Top: Data Engineering CS 510 Top: Ethics in Artificial Intelligence CS 510 Top: Exploring Fractals CS 510 Top: Formal Proof Foundations CS 510 Top: Foundations of Computer Vision CS 510 Top: Foundations of Emerging Technologies CS 510 Top: Generative Security Applications CS 510 Top: Graphical Models for Optimization and Learning CS 510 Top: Introduction to Computational Imaging CS 510 Top: Introduction to Computational Photography CS 510 Top: Introduction to Data Mining CS 510 Top: Introduction to Healthcare Data Analytics CS 510 Top: Introduction to Privacy-aware Computing CS 510 Top: Introduction to Quantum Computing CS 510 Top: Large Language Models CS 510 Top: Mobile and Wireless Networks CS 510 Top: Mobile Health CS 510 Top: Mobile Health in the COVID Era CS 510 Top: Natural Language Processing CS 510 Top: Networked Markets CS 510 Top: Operating System Internals CS 510 Top: Programming Language Compilation CS 510 Top: Proof Assistants and Program Verification CS 510 Top: Reinforcement Learning CS 510 Top: Rust for Small Systems Programming CS 510 Top: Rust Programming CS 510 Top: Rust Web Development CS 510 Top: Secure System Administration and DevOps CS 510 Top: Unconventional Cameras CS 510 Top: Usability Engineering CS 510 Top: Wireless Networks and Applications CS 610 Top: Computational Photography CS 610 Top: Graphical Models for Optimization and Learning CS 510 Top: Virtual Reality Other Courses: CS 520 Object-Oriented Programming and Design CS 542 Advanced Artificial Intelligence: Combinatorial Games CS 543 Advanced Artificial Intelligence: Combinatorial Search CS 546 Advanced Topics in Machine Learning CS 549 Computational Geometry CS 550 Parallel Algorithms CS 552 Building Software Systems with Components CS 553 Design Patterns CS 555 Software Specification and Verification CS 556 Software Implementation and Testing CS 559 Software Measurement & Models CS 560 Human-Computer Interaction CS 561 Open Source Software Development Laboratory CS 562 Advanced Open Source Software Engineering CS 567 The Wireless Web CS 568 Functional Logic Programming CS 570 Machine Learning Seminar CS 572 Operating System Internals CS 575 Computer Systems Analysis CS 579 Formal Verification of Hardware/Software Systems CS 582 Theory of Computation: Advanced Topics CS 583 Automata and Formal Languages CS 597 Sensor Networks CS 598 Introduction to Wireless Network Protocols CS 653 Design Patterns CS 655 Software Specification and Verification CS 656 Software Implementation and Testing CS 659 Software Measurement & Models CS 668 Functional Logic Programming CS 672 Operating System Internals Other Special Topic Courses: CS 510 Top: Advanced Functional Programming CS 510 Top: Advanced Java Programming CS 510 Top: Algorithms Coding CS 510 Top: Generative AI CS 510 Top: Introduction to HCI CS 510 Top: Introduction to Visual Computing CS 510 Top: Languages and Low-Level Programming CS 510 Top: Markets and the Internet CS 510 Top: Modern Agile and Other XP Software Engineering CS 510 Top: Modern Embedded Computing CS 510 Top: Network Security CS 510 Top: Practicum in Asynchronous Systems and Algorithms CS 510 Top: Software Design Patterns CS 510 Top: Spoken Language Interfaces CS 510 Top: Theorem Proving and Program Verification CS 510 Top: Topics in Software Validation CS 510 Top: Unit Test Branching Strategy CS 510 Top: User Interfaces CS 510 Top: Compilers and Interpreters To review course descriptions of previously offered courses, please contact the instructor or review the PSU Bulletin . CS Catalogs 2021-22 2020-21 2019-20 2018-19 2017-18 2016-17 2022-23", "metadata": {"source": "https://pdx.edu/computer-science/graduate-courses", "title": "Graduate Courses | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Computer Science The Department of Computer Science offers a full range of courses and degree programs. Our programs, in addition to the opportunities to develop professional skills through MECOP and PCEP, are designed to provide students with the educational background to achieve a career in the computing industry. With over 800 undergraduate CS majors and almost 200 graduate students, we offer a community to learn, discover, innovate, and share a curriculum based on the application and theoretical foundations of Computer Science. The department is home to 31 regular faculty members who specialize in a variety of research areas such as computer graphics and vision, computer security, databases, intelligent systems, programming languages, software engineering, open source software, sensor networks, and high performance computing. We invite you to join our Computer Science community and to explore our programs! Department Office Hours: The department is operating during regular hours but, due to the pandemic, we are relying on virtual meetings, except for absolutely critical activities. Please contact an appropriate person on the list below if you need help via email or if you would like to arrange a time for a phone call or an in-person or online meeting: Undergraduate Advising: uccs@pdx.edu Graduate Admissions & Advising: gccs@pdx.edu Department Manager: sarreal@pdx.edu Department Chair: mpj@pdx.edu Department Services Coordinator: elisa.salgado@pdx.edu CS Office: csoffice@pdx.edu We look forward to hearing from you and will do our best to respond as soon as we can. ABOUT THE MASEEH COLLEGE OF ENGINEERING AND COMPUTER SCIENCE Computer Science is one of five departments within the Maseeh College of Engineering and Computer Science . At the Maseeh College, we offer academic programs that provide transformative opportunities within the classroom and beyond. If you join our college, you'll be connected to Portland’s growing, innovative industries and prepared to gain competitive jobs in engineering and computer science. Our close ties to leading tech companies give you the opportunity to build your professional skills through internship programs while you complete your degree. You can participate in research, community-based learning projects and opportunities to develop your own ideas from proposal to prototype through our innovation programs. Our students are in demand in the Portland job market and beyond, and they report the highest annual earnings of all PSU graduates one year after graduation. 8.3.0 Apply to PSU Explore Maseeh Visit Campus Undergraduate Programs Graduate Programs CS Student Resources Research The Computer Science Department's Coronavirus Response The Portland State University community stands together against the global COVID-19 pandemic. Find out more with the latest updates about how the Computer Science department is responding. Coronavirus Response Statement from the Department Chair A statement from Dr. Mark Jones, Computer Science Department Chair. Read Statement Quick Links CS Advising Course Schedule Forms & Policies Postbac Options", "metadata": {"source": "https://pdx.edu/computer-science/computer-science-0", "title": "Computer Science | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Faculty and Staff Directory Faculty Faculty Office & Contact Information Office Hours Ameeta Agrawal , Assistant Professor FAB 115-15 ameeta@pdx.edu By Appointment Stephanie Allen , Senior Instructor FAB 120-19 steallen@pdx.edu TBD Thurs 3 - 5 PM In-Person in FAB 120-19 or Zoom (email for link) Ehsan Aryafar , Wedge Vision Associate Professor FAB 115-12 earyafar@pdx.edu 503-725-9366 By Appointment Sayan Bandyapadhyay , Assistant Professor FAB 115-14 sayan.b@pdx.edu TBD By Appointment Nirupama Bulusu , Professor FAB 120-24 nbulusu@pdx.edu 503-725-2404 By Appointment Katie Casamento , Senior Instructor FAB 115D cas28@pdx.edu 503-725-2513 251: Weds 3 - 4 PM CR&R: Thurs 3 - 4 PM 311: Thurs 4 - 5 PM In-Person in the Fishbowl or Zoom (link in syllabus) Jesse Chaney , Senior Instructor FAB 120-13 rchaney@pdx.edu By Appointment David Ely , Senior Instructor FAB 120-17 ely@pdx.edu 503-725-6275 By Appointment Karla Fant , Senior Instructor FAB 120-26 karlaf@pdx.edu 503-725-5394 Tues & Thurs 2 - 2:50 PM In-Person or Zoom. Also can schedule an appointment at https://forms.gle/xpAT4w7Q6oarauEF9. Wu-chang Feng , Professor FAB 120-14 wuchang@pdx.edu 503-725-2409 By Appointment Wu-chi Feng , Professor FAB 120-22 wuchi@pdx.edu 503-725-2408 By Appointment James Hook , Professor EB 502 james.hook@pdx.edu 503-725-5166 By Appointment Atul Ingle , Assistant Professor FAB 120-04 atul.ingle@pdx.edu 503-725-3108 Mon/Weds 10:15 - 11:15 AM In-Person in the CS Fishbowl Bruce Irvin , Senior Instructor FAB 120-11 rbi@pdx.edu 503-725-6109 Weds 1 PM or By Appointment In-Person near Lincoln Hall #247 Mark P. Jones , Professor & Department Chair FAB 120-20 mpj@pdx.edu 503-725-3206 By Appointment Karen L. Karavanic , Professor FAB 120-12 karavan@pdx.edu 503-725-5491 By Appointment Jingke Li , Associate Professor & Associate Chair FAB 120-06 lij@pdx.edu 503-725-4053 Tues & Thurs 1 - 2 PM In-Person in FAB 120-06 Yao Li , Assistant Professor FAB 120-01 liyao@pdx.edu 503-725-6276 Thurs 2 - 3 PM or By Appointment In-Person Feng Liu , Professor FAB 120-08 fliu@pdx.edu 503-725-3221 By Appointment Kunpeng Liu , Assistant Professor FAB 115-10 kunpeng@pdx.edu TBD By Appointment Bart Massey , Associate Professor FAB 120-18 masseyb@pdx.edu 503-725-5393 By Appointment only In-Person or Zoom. Students can PM on the course Zulip (preferred) or can email. Kevin McGrath , Senior Instructor FAB 120-15 dmcgrath@pdx.edu By Appointment Primal Pappachan , Assistant Professor FAB 115-08 primal@pdx.edu TBD Thurs 11 AM - 12 PM In-Person in FAB 115-08 or Zoom by appointment Caterina Paun , Senior Instructor FAB 115C caterina@pdx.edu 503-725-2518 By Appointment Shravas Rao , Assistant Professor FAB 115 B shravas@pdx.edu 503-725-6975 By Appointment Banafsheh Rekabdar , Assistant Professor FAB 115-13 rekabdar@pdx.edu By Appointment Zoom only Marly Roncken , Research Professor FAB 105 mroncken@pdx.edu By Appointment Suresh Singh , Professor FAB 120-16 singhsp@pdx.edu 503-725-5402 By Appointment Fang Song , Associate Professor FAB 120-25 fsong@pdx.edu 503-725-4060 By Appointment Andrew Tolmach , Professor FAB 120-23 tolmach@pdx.edu 503-725-5492 By Appointment, email to schedule a time In-Person or Zoom Michael Wilson , Senior Instructor FAB 120-09 mmw23@pdx.edu By Appointment Fei Xie , Professor FAB 120-10 xie@pdx.edu 503-725-2403 By Appointment Zoom only Affiliate Faculty Instructor Office & Email Alex Hunt , Associate Professor EB 402M, ajh26@pdx.edu Christof Teuscher , Professor FAB 160-07, teuscher@pdx.edu Other Instructors Instructor Office & Email Office Hours Casey Bailey , Adjunct Instructor TBD cb33@pdx.edu By Appointment Chris Gilmore , Adjunct Senior Instructor TBD grimjack@pdx.edu By Appointment Saba Izadkhah , Graduate Teaching Assistant TBD izadkhah@pdx.edu By Appointment Yeganeh Jalalpour , Graduate Teaching Assistant TBD yeganeh@pdx.edu By Appointment Chris Kim , Adjunct Instructor TBD chris.kim@pdx.edu By Appointment Kira Klingenberg, Graduate Teaching Assistant TBD kirak@pdx.edu By Appointment Zhan Li Graduate Teaching Assistant TBD lizhan@pdx.edu By Appointment Daniel Leblanc , Adjunct Instructor TBD dleblanc@pdx.edu By Appointment David Lu , Adjunct Instructor TBD dlu@pdx.edu 503-725-5540 By Appointment Sarah Mocas, Adjunct Senior Instructor bcsm@pdx.edu By Appointment Anthony Rhodes , Adjunct Senior Instructor TBD arhodes@pdx.edu 503-725-2519 Mon 11 AM - 12 PM Zoom only Sascha Strand , Adjunct Instructor TBD sastrand@pdx.edu By Appointment Pan Tan, Graduate Teaching Assistant TBD ptan@pdx.edu By Appointment Mina Vu, Adjunct Instructor TBD mina8@pdx.edu By Appointment Shuwen Wang , Adjunct Instructor TBD shuwen@pdx.edu By Appointment Zoom only Jack Weast , Adjunct Instructor TBD jweast@pdx.edu By Appointment David Whitlock , Adjunct Instructor TBD whitlocd@pdx.edu By Appointment Charles Winstead , Adjunct Assistant Professor TBD winstead@pdx.edu By Appointment Emeritus Faculty Emeritus Professors Maria Balogh , maria@cs.pdx.edu Lois Delcambre , lmd@pdx.edu Leonard Shapiro , len@cs.pdx.edu Andrew Black , apblack@pdx.edu 503-725-2411 Richard Hamlet , hamlet@cs.pdx.edu Tim Sheard , sheard@cs.pdx.edu Cynthia Brown , cbrown@cs.pdx.edu James Hein , jlhein@gmail.com Bryant York , bwyork@pdx.edu Warren Harrison , warren@pdx.edu David Maier , maier@pdx.edu 503-725-2406 Staff Staff Office & Contact Information Kristine-Anne Sarreal , Department Manager FAB 120-02 sarreal@pdx.edu 503-725-4255 Barbara Sabath , Undergraduate Advisor FAB 122-02 uccs@pdx.edu 503-725-4220 Ella Barrett , Graduate Advisor FAB 120-07 gccs@pdx.edu 503-725-6591 Beth Phelps , Hiring & Scheduling Coordinator FAB 115A phelpse@pdx.edu 503-725-4210 Elisa Salgado , Department Services Coordinator FAB 120A elisa.salgado@pdx.edu 503-725-3234 8.3.4", "metadata": {"source": "https://pdx.edu/computer-science/faculty-and-staff-directory", "title": "Faculty and Staff Directory | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Computer Science Minor Program Requirements The CS minor coursework enables students to learn one or more current programming languages and to develop and practice their problem-solving skills. Earning a CS minor in addition to a major program of study gives students seeking careers in liberal arts, business, health, and other fields an opportunity to increase their competitiveness in our increasingly technology-driven workplace. To earn a minor in computer science, a student must complete the requirements in the Bulletin for the relevant catalog year: Current requirements (for 2022-23 and 2023-24 ) Earlier requirements (for 2020-21 and 2021-22 ) Students following a catalog prior to 2023-24 should speak with an advisor about potential course substitutions. For guidance on how to add the minor to your degree program or graduation application, or to ask questions relating to course selection, please contact our Undergraduate Advisor, at uccs@pdx.edu .", "metadata": {"source": "https://pdx.edu/computer-science/minor", "title": "Computer Science Minor | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Advising Computer Science Advising Academic advising is a collaborative process.  Our advisors can help in many ways, including: planning your program; resolving registration issues; getting transfer courses evaluated; and scheduling courses.  Advisors can also connect you with resources to help you succeed in your studies and to find community and work experience. Please see the sections below for information about how to connect with an advisor.  We also have some quick links for common requests: Overrides for CS courses (CS 161, 162, 163, 201, 250, 251, 302). Students requiring a signature for a petition should schedule an appointment. All new undergraduate students are required to meet an advisor within their first two terms of enrollment at PSU. Students can set up an appointment to fulfill this mandatory advising requirement by calling 503-725-4631 or schedule directly online. Prospective & Lower-Division CS Students All prospective CS students and current lower-division undergraduate students who are not formally admitted to the CS department are advised by our Student Services advisors: Chandler Duff, Karen Kennedy, Linda Wasson, and Jodi Stiegemeyer. Prospective post-bac students must attend a CS Post-bac info session prior to setting up an appointment with an advisor. Location : The Office of Student Services in the Engineering Building (EB), suite 100 Schedule an Appointment : Call 503-725-4631 or check the Pathway Advising page for information about how to meet with an advisor. Upper-Division CS Students and all BMI Students Barbara Sabath provides advising to upper-division (junior and senior) students admitted to the Computer Science (CS) program and Biomedical Informatics (BMI) students. Location : The Computer Science Advising offices in the Fourth Ave Building (FAB), suite 120 Schedule an Appointment : Call 503-725-4631 or schedule online using the appropriate link, either for current CS majors (Odin login required) or for prospective or returning CS students . Drop-in Advising : 10-11am Monday and 2-3PM Wednesday. Begin by completing this form bit.ly/MCECSDROPIN at the start of the drop in hour. Then you will be sent the zoom link. Please check this page for updates in the event of cancelled drop-in hours. Prospective Post-Bac and Graduate CS students Ella Barrett, the CS Graduate Advisor, provides advising to prospective post-baccalaureate students and all CS graduate students. Prospective post-bac students must attend a CS Post-bac info session prior to setting up an appointment with a CS advisor. Location : The Computer Science Advising offices in the Fourth Ave Building (FAB), suite 120. Schedule an Appointment : Go to YouCanBookMe . Drop-in Advising : 4-5pm Mondays and Wednesdays (in person or Zoom) for current students only. Begin by completing this form , which opens at the start of the drop-in hour and closes at the end. You will be helped shortly after submitting the form, in the order you signed-up in. Wait times will depend on how many students are ahead of you. Instructions for joining drop-in hours will be available immediately after submitting the form Useful Links Registration Financial Aid Career Office of the Registrar about PSU Bulletin about Academic Calendar about DARS about Course Search about Course Projections Guide about Financial Aid about Student Finance about Scholarship Information about Scholarship Application about Scholarship Database about Advising Services about Career Services about MCECS Career Services about MCECS Job Portal about", "metadata": {"source": "https://pdx.edu/computer-science/advising-0", "title": "Advising | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Undergraduate Program Objectives & Student Outcomes Program Educational Objectives The objective of the undergraduate program in Computer Science is to produce graduates who, 3-5 years after graduation: Have made initial advances on a successful career path that leverages the knowledge and skills they acquired in our program; Consistently demonstrate their commitment, in principle and in practice, to upholding the highest standards of professionalism, integrity, and ethical behavior; and Exhibit the motivation, preparation, and ability to adapt to rapidly changing technology and to engage in life-long learning. To achieve these objectives students should master the following learning-based outcomes. Student Outcomes Students in the undergraduate program in Computer Science are expected to master the following competencies (learning based student outcomes). Reflecting the high-level structure, the list is organized as two groups, one focused on skills outcomes (using labels that begin with A) and the other on knowledge outcomes (using labels that begin with B). Graduates of the undergraduate program in computer science will have an ability to: A1.  Analyze a complex computing problem and apply principles of computing and other relevant disciplines to identify solutions. A2.  Design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline. A3.  Communicate effectively in a variety of professional contexts. A4.  Recognize professional responsibilities and make informed and equitable judgments in computing practice based on legal and ethical principles. A5.  Function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline. A6.  Apply computer science theory and software development fundamentals to produce computing-based solutions. B1.  Apply knowledge and skills in the foundations of computer science. B2.  Apply knowledge and skills in the area of systems and data. B3.  Apply knowledge and skills in professional design and development. Notes: The first groups of outcomes, A1-A6, are the required student outcomes described in the ABET “Criteria for Accrediting Computing Programs, 2022 – 2023” for “Computer Science and Similarly Named Programs”. The second group of outcomes, B1-B3, reflect an organization of the knowledge components of our curriculum in line with the taxonomy of the ACM/IEEE CS 2013  “Curriculum Guidelines for Undergraduate Programs in Computer Science” and the CC2020 “Computing Curricula 2020: Paradigms for Global Computing Education”. The three areas specified in the adopted outcomes correspond to the following groupings of topics, each of which has approximately the same aggregate weighting in the curriculum guidelines: Foundations of Computer Science : Algorithms and Complexity (AL), Discrete Structures (DS), and Programming Languages (PL); Systems and Data : Architecture and Organization (AR), Computational Science (CN), Graphics and Visualizations (GV), Information Management (IM), Intelligent Systems (IS), Networking and Communication (NC), Operating Systems (OS), Parallel and Distributed Computing (PD), and Systems Fundamentals (SF); Professional Design and Development : Human Computer Interaction (HCI), Information Assurance and Security (IAS), Platform-based Development (PBD), Software Development Fundamentals (SDF), Software Engineering (SE), and Social Issues and Professional Practice (SP). Mapping Between Objectives and Outcomes The mapping between the sets of program educational objectives and student outcomes listed above is summarized in the following table: Program Educational Objectives Student Outcomes Skills Knowledge A1 A2 A3 A4 A5 A6 B1 B2 B3 1. Have made initial advances on a successful career path that leverages the knowledge and skills they acquired in our program X X X X X X X 2. Consistently demonstrate their commitment, in principle and in practice, to upholding the highest standards of professionalism, integrity, and ethical behavior X X X 3. Exhibit the motivation, preparation, and ability to adapt to rapidly changing technology and to engage in life-long learning X X X X X X X X X The items on this page were last reviewed and updated by the faculty in Fall 2023.", "metadata": {"source": "https://pdx.edu/computer-science/program-objectives-outcomes", "title": "Undergraduate Program Objectives & Student Outcomes | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Policies and Governance Official documents to be posted soon.", "metadata": {"source": "https://pdx.edu/computer-science/policies-and-governance", "title": "Policies and Governance | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Internship Credit The Portland Metro area offers many opportunities for internships to graduate students. Many students complete one or more internships with local companies during their time at PSU. We believe internships provide a valuable training experience which significantly augments the student’s academic program. While some students choose to participate in an internship without receiving college credit, other students find it important that they receive college credit for their internships. NOTE: Internship credits will not be counted towards the CS degree requirements To receive credit for an internship, a student: Must have completed at least 24 credits at PSU towards their PSU CS Degree by the time the internship begins, including at least 2 PSU CS graduate core courses with a grade of B or better; May count undergraduate CS courses taken at PSU that have not been applied to another degree; Must be admitted to the MS or PhD program; Must have filed a CS Masters or PhD Plan of Study; and Must have a PSU CS GPA of at least 3.0 and be in good academic standing as defined by the University and the CS Department. International students will also have to meet the requirements for Curricular Practical Training (CPT) and must consult with the Office of International Students and Scholars Services (intl-services@pdx.edu) to check eligibility. You and your employer should complete and sign the Graduate Internship Approval Form and submit it, along with copies of the internship offer letter, a copy of your current DARS or transcripts, and your approved plan of study to the CS Graduate Advisor no later than the end of the first week of the quarter. We will forward your documents to the appropriate offices on campus and provide you with a copy of all the documents. Once registration opens, we process internship paperwork once a week on Fridays. At the end of each quarter of the internship, make sure you submit a Graduate Internship Status Report form that is signed by both the student and your Supervisor. This will be due to the Computer Science Internship Director no later than 5pm Friday of finals week for the term.Failure to submit the Internship Status Report by the deadline for the term will result in the student receiving a \"No-Pass\" as a grade. In order to get credit for your internship, you’ll need to submit a Special Registration form for CS 504. See the Graduate Advisor to get a copy for the current term.", "metadata": {"source": "https://pdx.edu/computer-science/graduate-internship-credit", "title": "Graduate Internship Credit | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Programs Request Info Apply to PSU Postbac Info Our professional graduate programs in Computer Science offer graduate students the structure and push they need to propel their careers forward. Our renowned faculty provide advising and mentorship to graduate students, along with course offerings that specialize in emerging fields of computing such as Machine Learning and Artificial Intelligence, Networks and Security, Data Management and Cloud Computing. The college offers a career director with industry experience to guide our students toward jobs and internship opportunities. Our programs are tightly connected to the many growing and leading tech companies where our graduates earn jobs with competitive starting salaries. For questions regarding our graduate programs, please contact the CS Graduate Advisor ( gccs@pdx.edu ). Graduate Programs Master of Science Doctor of Philosophy Cybersecurity Certificate Grad Prep Master of Science The Master of Science in Computer Science can take about one and a half years of full-time study to complete. The program is intended to provide a strong foundation in the field, along with room for specialization. Doctor of Philosophy The Doctor of Philosophy (Ph.D.) is the highest degree offered in any discipline. It is intended for those who will pursue research in the field of Computer Science. Cybersecurity Certificate The graduate certificate is awarded to students who complete 21 credits in the specialized area of Cybersecurity. Grad Prep A postbac option, the Graduate Preparation Track program can assist high performing, motivated students in mastering the essential computer science core to be successful in the CS Master's program. Previous Next Quick Links Advising Admission Course Schedule Forms & Policies Graduate Courses Track Courses Research Proficiency Exam Recent News April 3rd 2024 Fostering Cybersecurity Literacy in the Native Community: The Pedagogy and Practice of CyberPDX Maseeh College places great value on being an access university, serving... February 6th 2024 The Perils and Possibilities of AI: A Conversation with Ameeta Agrawal Artificial Intelligence is a hot topic these days, inspiring both excitement... January 12th 2024 Sloan grant will help PSU graduate more diverse STEM doctorate students Portland State is home to Oregon’s most diverse undergraduate student population... See all News Upcoming events See full events calendar", "metadata": {"source": "https://pdx.edu/computer-science/graduate", "title": "Graduate Programs | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Master's Track Courses As part of the degree requirements for the CS Master's program, students must complete three courses from one of the following tracks: Artificial Intelligence & Machine Learning Databases Languages & Programming Security Software Engineering Systems & Networking Track substitutions with other courses in the topic area may be permitted with the approval of the CS Graduate Advisor ( gccs@pdx.edu ). Artificial Intelligence & Machine Learning The Artificial Intelligence and Machine Learning track covers modern algorithms underlying intelligent and learning systems. Examples of topics covered in courses on this track include knowledge representation, planning, reasoning, combinatorial and adversarial search methods, natural language processing, computer vision, statistical machine learning, and evolutionary and reinforcement learning. CS 541 Artificial Intelligence (3) CS 545 Machine Learning (3) One course from the following: CS 542 Advanced Artificial Intelligence: Combinatorial Games (3)** CS 543 Advanced Artificial Intelligence: Combinatorial Search (3)** CS 546 Advanced Topics in Machine Learning (3) ** CS 570: Machine Learning Seminar (3) STAT 671: Statistical Learning I (3) STAT 672: Statistical Learning II (3) STAT 673: Statistical Learning III (3) SYSC 557 Artificial Life (4) OHSU CS 623 Deep Learning (3)* OHSU CS 562 Natural Language Processing* OHSU 5/692 Ethics in AI and Machine Learning Research* Any approved CS 510 Course in AI or Machine Learning *Courses taken through the Joint Campus Program are considered transfer courses. Databases The Database track covers concepts, languages, implementation and application of  database management systems. Other topics that have been offered in the track include formal  foundations of databases, databases for cloud and cluster environments, and data stream systems. CS 586 Intro to Database Management Systems (3) Two courses from the following: CS 530 Internet, Web, & Cloud Systems (3) CS 587 Database Management System Implementation (3) CS 588 Cloud & Cluster Data Management (3) CS 589 Principles of Database Systems (3)** Any approved CS 510 course in Databases Languages & Programming The Languages & Programming track focuses on the design, implementation, and use of programming languages. It includes exposure to a variety of programming paradigms, experience using programming languages to express the essential abstractions of a problem domain, courses on programming language implementation, and the study of formal methods for specifying and reasoning about programs and programming languages. CS 558 Programming Languages (3) Two courses from the following: CS 515 Parallel Programming (3) CS 520 Object Oriented Programming (3)** CS 553 Design Patterns (3) CS 557 Functional Languages (3) CS 568 Functional Logic Planning (3)** CS 577 Modern Language Processors (3) CS 578 Program Language Semantics (3)** Any approved CS 510 course in Languages & Programming Security The Security track focuses on protecting computing systems and user data from unauthorized access and use.  Topics include cryptography, network and host-based access control, vulnerability analysis, penetration testing, and reverse engineering. CS 591 Introduction to Computer Security (3) Two courses from the following: CS 530 Internet, Web, & Cloud Systems (3) CS 576 Computer Security Seminar (3)** CS 585 Cryptography (3) CS 592 Malware Reverse Engineering (3) CS 593 Digital Forensics (3)** CS 595 Web and Cloud Security (3) CS 596 Network Security (3) Any approved CS 510 course in Security Software Engineering The Software Engineering track studies the principles, processes, techniques, and tools for building software systems.  Topics include software requirement, design, development, validation, and maintenance. CS 554 Software Engineering (3) Two courses from the following: CS 530 Internet, Web, & Cloud Systems (3) CS 552 Building Software Systems w/ Components (3)** CS 553 Design Patterns (3) CS 555 Software Specification & Verification (3)** CS 556 Software Implementation and Testing (3)** CS 561 Open-source Software Development (3) CS 565 Full Stack Web Development (3) Any approved CS 510 course in Software Engineering Systems & Networking The Systems and Networking track studies the design and implementation of operating systems, wired and wireless computer networks including high performance computer systems, data centers, cloud computing architectures, distributed systems, fault tolerance, concurrency, systems programming, and theoretical topics related to these areas. CS 533 Concepts of Operating Systems (3) CS 594 Internetworking Protocols (3) One course from the following: CS 515 Parallel Programming (3) CS 530 Internet, Web, & Cloud Systems (3) CS 531 Introduction to Performance (3) CS 535 Accelerated Computing (3) CS 538 Computer Architecture (3) CS 572 Operating Systems Internals (3)** CS 590 Introduction to Multimedia Computing and Networking (3) CS 598 Introduction to Wireless Network Protocols (3) ECE 586 Computer Architecture (4) Any approved CS 510 course in Systems & Networking *CS 532 does not count towards the track", "metadata": {"source": "https://pdx.edu/computer-science/node/171", "title": "Master's Track Courses | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Honors Track The Computer Science Honors Program provides a valuable opportunity for qualified students to research a specialty area within Computer Science with a faculty advisor. Admission Requirements Completion of CS Honors program form Admission to the CS Upper Division Program Minimum overall 3.5 PSU GPA and minimum 3.5 GPA in CS courses Program Requirements Upon acceptance to the CS Honors program, the student must declare a research area of interest within Computer Science no later than the beginning of their Senior year (preferably by Spring quarter of Junior year). The CS Chair will assign a faculty advisor to help an Honors student complete a written proposal for the Honors thesis research. CS Honors theses will follow ACM document guidelines for style and formatting. The Honors thesis research is usually conducted after the completing the course requirements of the student's Junior year. Graduation Requirements Completion of a written Honors thesis, in conjunction with a faculty advisor, with a minimum grade of B+. Presentation of research to CS faculty and students in a seminar format. Minimum overall 3.5 PSU GPA Note: Honors Thesis (CS 403) may qualify as an approved CS elective.", "metadata": {"source": "https://pdx.edu/computer-science/honors-track", "title": "Honors Track | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Internship Credit The Portland Metro area offers many opportunities for internships to graduate students. Many students complete one or more internships with local companies during their time at PSU. We believe internships provide a valuable training experience which significantly augments the student’s academic program. While some students choose to participate in an internship without receiving college credit, other students find it important that they receive college credit for their internships. NOTE: Internship credits will not be counted towards the CS degree requirements To receive credit for an internship, a student: Must have completed at least 24 credits at PSU towards their PSU CS Degree by the time the internship begins, including at least 2 PSU CS graduate core courses with a grade of B or better; May count undergraduate CS courses taken at PSU that have not been applied to another degree; Must be admitted to the MS or PhD program; Must have filed a CS Masters or PhD Plan of Study; and Must have a PSU CS GPA of at least 3.0 and be in good academic standing as defined by the University and the CS Department. International students will also have to meet the requirements for Curricular Practical Training (CPT) and must consult with the Office of International Students and Scholars Services (intl-services@pdx.edu) to check eligibility. You and your employer should complete and sign the Graduate Internship Approval Form and submit it, along with copies of the internship offer letter, a copy of your current DARS or transcripts, and your approved plan of study to the CS Graduate Advisor no later than the end of the first week of the quarter. We will forward your documents to the appropriate offices on campus and provide you with a copy of all the documents. Once registration opens, we process internship paperwork once a week on Fridays. At the end of each quarter of the internship, make sure you submit a Graduate Internship Status Report form that is signed by both the student and your Supervisor. This will be due to the Computer Science Internship Director no later than 5pm Friday of finals week for the term.Failure to submit the Internship Status Report by the deadline for the term will result in the student receiving a \"No-Pass\" as a grade. In order to get credit for your internship, you’ll need to submit a Special Registration form for CS 504. See the Graduate Advisor to get a copy for the current term.", "metadata": {"source": "https://pdx.edu/computer-science/node/276", "title": "Graduate Internship Credit | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Internships and Research Internships We encourage our students to do at least one internship in the course of their undergraduate career, as a complement to the formal academic training we offer. Students can obtain interesting positions where they can exercise the skills they learn in the classroom while exploring potential employers. Our rich environment of high-tech companies make this an attractive prospect. The Maseeh College of Engineering and Computer Science participates in the MECOP program , which is an industry-run internship program that offers trained mentors and interesting experiences in a variety of regional companies. Students must interview to be accepted to the program. Once accepted, they do two six-month paid internships and graduate with a degree, a resume, and a network of potential employers. The PSU/PDX Cooperative Education Program (PCEP) is a two year cooperative educational program in which Computer Science students work 20 hours per week at one of our local PCEP Partner companies in a series of defined internship roles, while concurrently taking eight credits each term at PSU. Undergraduate and graduate students are welcome to apply. Local employers also seek out our students for less formal internship opportunities. We maintain a bulletin board where students can review jobs and internships related to Computer Science. Research We have a wide variety of research programs. Our faculty enjoy working with undergraduates and many of them have funding for summer jobs for students to work on research. Students can also get project credit for this work or can do unpaid projects during the academic year. Students who plan on advancing to graduate school are advised to accumulate research experience as undergraduates. We have placed students from our program at top schools such as Carnegie-Mellon, University of Washington, and Berkeley, based on this type of experience along with excellent grades.", "metadata": {"source": "https://pdx.edu/computer-science/internships-and-research", "title": "Internships and Research | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Coronavirus Response Due to concerns related to the spread of COVID-19, the Department of Computer Science is currently operating during regular hours but relying on virtual meetings, except for absolutely critical activities. Please contact an appropriate person on the list below if you need help via email or if you would like to arrange a time for a phone call or an in-person or online meeting. Undergraduate Advising: uccs@pdx.edu Graduate Advising: gccs@pdx.edu Department Manager: sarreal@pdx.edu Department Chair: mpj@pdx.edu CS Office: csoffice@pdx.edu Please visit https://www.pdx.edu/coronavirus-response for additional information, resources, and updates. CS Tutors (Undergraduate Lower Division Courses) We have transitioned CS Tutoring to an online format using slack as our primary form of contact.  (If you have not previously used slack: please visit pdx-cs.slack.com , click the “create an account” link and follow the instructions on screen. Once you are logged in, click on the “cshelp” channel in the sidebar on the left.) Tutors will be available on Monday to Friday (11am-6pm) and on Saturday (12-6pm). Their primary role is to provide help for CS 161, CS 162,  CS 163, and CS 202. The tutors may also be able to provide some support for CS 201, CS 250, and CS 251. For the latter group of courses, however, it is recommended (and for all other courses not listed here, it is required) that students contact their instructor or class TA for help. A student can request help from a tutor by posting a short message on the cshelp slack channel that includes the class number and a very brief description of the problem that they need help with. These messages are public so they must not include any personal details, including code or any other part of a student’s solution to a problem. A tutor will then follow-up using direct messaging and, if appropriate, may also offer a zoom meeting for one-on-one interaction. If the tutor determines that a given question can be answered without personal information, and that the answer may be useful to other students, then they may respond by starting a new public thread instead. All conversations with a tutor must begin with a posting on the cshelp channel; it is important that students do not otherwise direct message tutors with questions.", "metadata": {"source": "https://pdx.edu/computer-science/coronavirus-response", "title": "Coronavirus Response | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Undergraduate Programs Explore Maseeh Apply to CS Postbac Info Our undergraduate programs in Computer Science are designed to provide students with the educational background to pursue professional and academic opportunities in the computing industry. The programs blend a core of programming languages and theory courses with a selection of elective courses over a wide range of CS topics. Admission to the CS upper division program, at the junior level, is contingent upon a student’s completion and success of the admission requirements. Those who are admitted will move forward with the undergraduate program. Those not admitted will be blocked from registering for upper division and/or graduate CS courses. The Portland State undergraduate Bachelor of Science Computer Science degree program is accredited by the Computing Accreditation Commission of ABET, https://www.abet.org , under the General Criteria and the Computer Science and Similarly Named Computing Program Criteria. This national organization sets standards for computer science education defined in terms of curricular content, quality of faculty, and adequacy of facilities. Undergraduate Programs Bachelor of Science Minor Honors Biomedical Postbac Bachelor of Science The Bachelor of Science in Computer Science is the first university degree in the field and may take at least four years of full-time work to complete. Minor Earning a CS minor gives students seeking careers in liberal arts, business, health, and other fields an opportunity to increase their competitiveness in our increasingly technology-driven workplace. Honors Our Honors track program provides a valuable opportunity for qualified students to research a specialty area within Computer Science with a faculty adviser. Biomedical Students in this program combine PSU and OHSU courses to receive both a B.S. Computer Science degree and a Master of Science in Biomedical Informatics degree at the end of five years. Postbac Whether you are thinking about pursuing a second bachelor’s or master’s degree, Portland State University offers multiple paths to our Computer Science programs. Previous Next Quick Links CS Advising Admission Course Schedule Forms & Policies PCEP Internship Courses Capstone Upcoming events See full events calendar Recent News April 3rd 2024 Fostering Cybersecurity Literacy in the Native Community: The Pedagogy and Practice of CyberPDX Maseeh College places great value on being an access university, serving... February 6th 2024 The Perils and Possibilities of AI: A Conversation with Ameeta Agrawal Artificial Intelligence is a hot topic these days, inspiring both excitement... January 12th 2024 Sloan grant will help PSU graduate more diverse STEM doctorate students Portland State is home to Oregon’s most diverse undergraduate student population... See all News", "metadata": {"source": "https://pdx.edu/computer-science/undergraduate", "title": "Undergraduate Programs | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Admission The Master of Science (M.S.) is the first graduate degree in the field. Students entering the program must have a bachelor's degree and/or adequate background in computer science, such as obtaining an undergraduate computer science program. The Doctor of Philosophy (Ph.D.) is the highest degree offered in any discipline. Students may enter the doctoral program with a bachelor's degree or with a master's degree, and must have adequate background in computer science. Application Deadlines The official deadlines for submission of all materials to the University are as follows: Fall Term 2024 (September start) : March 1st Priority for PhD program: December 15th Winter Term 2025 (January start) : September 15th Spring Term 2025 (April start) : November 1st PSU operates on a quarter system. For future or specific term dates, refer to the PSU Academic Calendar . Please note that these are the dates that the online application closes for the specified term. The application must be submitted by this date. Supporting documents such as test scores and recommendations may arrive after this deadline. Financial support, when offered, typically starts in Fall term. The deadlines for international students are anticipated to account for the time required to obtain visas. Applications should be received by the deadline of the term of admission. Incomplete applications will not be reviewed, so applicants are encouraged to complete all requirements prior to submitting the application. If you are unable to do so, please contact the Graduate Advisor ( gccs@pdx.edu ). Admission Requirements To be considered for admission, all applicants to the CS graduate programs must have: A four-year baccalaureate degree from an accredited institution 1 Minimum undergraduate GPA of 3.0 Proof of English Language Proficiency for International Students The GRE Requirement has been waived through Spring 2025 Graduate Record Examination (GRE) Scores Prospective graduate students are not required to have a Bachelor's degree in Computer Science, but they must make up the background needed for graduate study before applying for admission. See the Grad Prep page for more details. Minimum acceptance: 60th percentile in Quantitative and 25th percentile in Verbal. PhD applicants are expected to be above the minimum. GRE will be waived for an MS applicant if the student completes the Grad Prep program . Admission is selective and meeting minimum requirements does not guarantee admission. All admission decisions are based on the information a prospective student provides. Please contact the Graduate Advisor ( gccs@pdx.edu ) if you would like to discuss your specific situation. Admission Timeline Admission decisions are typically issued about 6-8 weeks after the application deadline (listed above) for complete applications. For applications that are incomplete after the deadline, admission decisions will be issued 6-8 weeks after all required documents have been received. Application Requirements Login or create a new account in the PSU application portal to start a single online application to Portland State University and to a CS graduate program. You will be able to save an incomplete application and return at a later time. Be prepared to submit the requested documents electronically before proceeding to the online application; do not mail any hard copies to the CS department. Please note – do not submit screenshots, photos, or participation certificates for extra-curriculars. For any questions about the online application form, please contact help@applyweb.com . For any questions regarding CS graduate admission, please contact the CS Graduate Advisor ( gccs@pdx.edu ). GRE Score Reports The GRE Requirement has been waived through Spring 2025 Official GRE scores will be required upon admission to a CS graduate program. If you do not have a copy to upload electronically, official copies can be requested from ETS and sent to School code 4610 and Department code 0402. If you have previously taken the GRE as part of another application to a graduate program at a U.S. institution, please contact the CS Graduate Advisor ( gccs@pdx.edu ). The GRE requirement for PhD applicants will only be waived by the admission committee under exceptional circumstances. Transcripts The CS graduate programs require copies of transcripts from each postsecondary institution you have attended (including PSU). Unofficial transcript copies are acceptable for application purposes. Official copies are required upon admission to the program. For more information, see PSU’s transcript requirements . References Contact information for two references are required, preferably those who know your academic performance and potential. Recommendation letters are also acceptable and can be submitted to the CS Graduate Advisor ( gccs@pdx.edu ). Short Personal Statement In 1-2 pages, introduce yourself, your plans, interests, and qualifications. This statement should include your background and interests in computer science, any relevant work experience, why you are seeking a graduate degree, and whether you plan to enroll part-time or full-time. If you plan to enroll part-time, describe your employment or major activities as well. If you are applying for immediate admission to the PhD program, include a description of your potential research area, faculty members you hope to collaborate, and your reasons for not entering the CS master’s program. English Language Proficiency Test Score Reports For international students only, please review the English Language Proficiency requirement webpage for more information about which tests are accepted, and what the minimum score requirements are. If a test score report copy is not available, please list the date the test was taken or will be be taken.", "metadata": {"source": "https://pdx.edu/computer-science/node/151", "title": "Graduate Admission | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Graduate Preparation Apply to PSU Apply to CS Postbac Info Many graduates with degrees in fields other than Computer Science are interested in pursuing a M.S. in Computer Science. The Graduate Preparation (or \"Grad Prep\") Track can assist a high performing, motivated student in mastering the essential computer science core necessary to be successful in the Master's program. The Grad Prep Track consists of a Programming & Languages Core and a Theory Core, comprised of many of the same classes taken by undergraduate Computer Science majors. Some of these courses have the option to test out of by demonstrating mastery based on either prior academic preparation or professional/personal programming experience through a credit by exam process. We encourage all prospective students to attend one of our monthly CS Postbac Info sessions first to learn more about our postbaccalaureate options . Contact the CS Graduate Advisor ( gccs@pdx.edu ) for any questions. Grad Prep Requirements To be eligible for admission to the CS Master's program, Grad Prep students must complete the following courses with a B or better. For Grad Prep students, the GRE is waived for the M.S. application . CS 199 Prog & Problem-solving: First Exploration (4 credits)* CS 161 Intro to Programming & Problem-solving (4 credits)* CS 162 Intro to Computer Science (4 credits)* CS 163 Data Structures (4 credits) CS 205 System Programming & Architecture (4 credits) CS 250 Discrete Structures I (4 credits) CS 251 Discrete Structures II (4 credits) CS 302 Programming Methodologies and Software Implementation (4 credits) CS 333 Intro to Operating Systems (4 credits) OR CS 532 Operating Systems Foundations (3 credits) CS 350 Algorithms and Complexity (4 credits) *Based on prior experience, a student may begin with any of these courses. See Introductory Course Guide for details. Admission to PSU To begin Grad Prep at PSU, prospective students must first apply for postbaccalaureate admission . Postbaccalaureate applications are processed as they are received, generally within 4-6 weeks. Sample Schedules Students who did not take math beyond pre-calculus in their prior coursework are strongly advised to take at least one such course (e.g. calculus, linear algebra, discrete math, etc.) prior to taking CS 250. This sample program assumes the student has modest programming experience and an adequate mathematical background. This sample program assumes the student has no prior programming experience and a limited mathematical background. Frequently Asked Questions Is the admission process to the CS program selective? No. At this time, all students that meet the admission requirements are admitted to the CS program. Can I have courses in progress while I submit my application? Yes, courses required for admission may be in progress at the time of application. If the in-progress coursework is not completed with the appropriate grade by the end of the term, CS admission may be revoked and the student may be dropped from all upper division CS courses (see number 4 below). What if I am in my last course at a community college and the course is not on my PSU DARS? Submit a current unofficial transcript from the college that shows the course in progress and your name and attach it to your application. Once your grade is recorded for this class, send an official transcript to PSU Admissions. What does conditional admittance mean? Students that apply to the program with courses in progress and have met all the other requirements will be admitted to the CS program on the condition that they receive a passing grade for the required classes in progress. Students will be allowed to register for upper division CS courses. At the end of the admission term, grades for classes which were in progress will be checked and students that have not passed will have their admission revoked and administratively dropped from their upper division CS courses. Once I'm admitted to the CS program, will my tuition increase? Yes, the Maseeh College of Engineering and Computer Science charges a differential tuition for admitted students to pay for use of College resources. Details of tuition and fees are located on Student Finance page . What if I am denied admission? Consult the CS Graduate Advisor ( gccs@pdx.edu ). Depending on the reason for the denial, you may request a review by the CS Appeals Committee.", "metadata": {"source": "https://pdx.edu/computer-science/node/191", "title": "Graduate Preparation | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Computer Science Courses Select the following links to view the course schedule of a specific term or to view the full course list of all CS courses available at PSU. Please note, schedules and courses are subject to change. CS Catalogs Fall 2023 - Summer 2024 Fall 2022 - Summer 2023 Fall 2021 - Summer 2022 Fall 2020 - Summer 2021 Fall 2019 - Summer 2020 Fall 2018 - Summer 2019 Fall 2017 - Summer 2018 Fall 2016 - Summer 2017 Course Descriptions Undergraduate Courses Graduate Courses Previously Offered Courses", "metadata": {"source": "https://pdx.edu/computer-science/computer-science-courses", "title": "Computer Science Courses | Portland State University", "language": "en"}, "type": "Document"}, {"page_content": "Courses Previously Offered CS course descriptions will be uploaded soon. Some course descriptions are located in the PSU Bulletin . CS 313 Artificial Intelligence and Game Design CS 410/510 Top: Advanced Counting, Probability & Computing CS 410/510 Top: Advanced Cryptography CS 410/510 Top: Advanced Multimedia Networking CS 410/510 Top: Advanced Open Source Software Eng CS 410/510 Top: Advanced Programming CS 410/510 Top: Advanced Software Engineering CS 410/510 Top: Advanced Topics in Networking CS 410/510 Top: Advanced Topics Software Engineering CS 410/510 Top: Algorithm Design & Analysis CS 410/510 Top: Automated Deduction CS 410/510 Top: Client & Server Side Applications For The Web CS 410/510 Top: Computer Performance Analysis CS 410/510 Top: Concurrent Systems CS 410/510 Top: Data Streams CS 410/510 Top: Database Internals CS 410/510 Top: Dependent Type Programming CS 410/510 Top: Distributed Computing CS 410/510 Top: Foundations of Database Systems CS 410/510 Top: Fundamentals of Staged Computation CS 410/510 Top: General Purpose GPU Computing CS 410/510 Top: Green Computing and Communications CS 410/510 Top: In Software Eng. New Ideas in Testing Theory CS 410/510 Top: Information Integration CS 410/510 Top: Information Security Assurance CS 410/510 Top: Information Theory CS 410/510 Top: Introduction to Computational Biology CS 410/510 Top: Introduction to Digital Forensics CS 410/510 Top: Introduction to Networking CS 410/510 Top: Introduction to Wireless Networking CS 410/510 Top: Malicious Code & Forensics CS 410/510 Top: Manipulating Data Using XML CS 410/510 Top: Mastery in Programming CS 410/510 Top: Mathematical Logic via Foundational Algorithms CS 410/510 Top: Measuring Computer Performance CS 410/510 Top: Mobile Computing CS 410/510 Top: Multicore CS 410/510 Top: Multicore Computing CS 410/510 Top: Multicore Computing: Practicum CS 410/510 Top: Multimedia Networking CS 410/510 Top: Nonstandard Computation CS 410/510 Top: Open Source Software Development in the Unix Environment CS 410/510 Top: Open Source Topic CS 410/510 Top: Performance Analysis of Heterogeneous Multi-Core Systems CS 410/510 Top: Programming the Web CS 410/510 Top: Secure Programming with SSL/TLS CS 410/510 Top: Security and Programming CS 410/510 Top: Software Security CS 410/510 Top: Topics in Wide Area Wireless Networks CS 410/510 Top: Using XML and Related Languages CS 410/510 Top: Wireless Networking Concepts CS 448/548 Computer Graphics II CS 465/565 Construction & Analysis of Web-Based Applications CS 489/589 Principles of Database Systems CS 573 Computer Communications CS 588 Distributed Database Systems CS 595 Network Routing CS 596 Network Management & Security", "metadata": {"source": "https://pdx.edu/computer-science/node/206", "title": "Courses Previously Offered | Portland State University", "language": "en"}, "type": "Document"}]